package org.example.Entity;

public class Bean_version_config {

    @Override
    public String toString() {
        return "Bean_version_config{" +
                "C_version_id='" + C_version_id + '\'' +
                ", C_source='" + C_source + '\'' +
                ", C_被动安全_被动行人保护='" + C_被动安全_被动行人保护 + '\'' +
                ", C_被动安全_侧安全气帘='" + C_被动安全_侧安全气帘 + '\'' +
                ", C_被动安全_第二排侧气囊='" + C_被动安全_第二排侧气囊 + '\'' +
                ", C_被动安全_第二排正向气囊='" + C_被动安全_第二排正向气囊 + '\'' +
                ", C_被动安全_第一排侧气囊='" + C_被动安全_第一排侧气囊 + '\'' +
                ", C_被动安全_儿童座椅接口='" + C_被动安全_儿童座椅接口 + '\'' +
                ", C_被动安全_副驾驶安全气囊='" + C_被动安全_副驾驶安全气囊 + '\'' +
                ", C_被动安全_副驾驶座垫式气囊='" + C_被动安全_副驾驶座垫式气囊 + '\'' +
                ", C_被动安全_后排安全带式气囊='" + C_被动安全_后排安全带式气囊 + '\'' +
                ", C_被动安全_后排座椅防下滑气囊='" + C_被动安全_后排座椅防下滑气囊 + '\'' +
                ", C_被动安全_缺气保用轮胎='" + C_被动安全_缺气保用轮胎 + '\'' +
                ", C_被动安全_膝部气囊='" + C_被动安全_膝部气囊 + '\'' +
                ", C_被动安全_中央安全气囊='" + C_被动安全_中央安全气囊 + '\'' +
                ", C_被动安全_主驾驶安全气囊='" + C_被动安全_主驾驶安全气囊 + '\'' +
                ", C_变速箱_变速箱类型='" + C_变速箱_变速箱类型 + '\'' +
                ", C_变速箱_变速箱描述='" + C_变速箱_变速箱描述 + '\'' +
                ", C_变速箱_挡位数='" + C_变速箱_挡位数 + '\'' +
                ", C_变速箱_卡车倒退挡位数='" + C_变速箱_卡车倒退挡位数 + '\'' +
                ", C_变速箱_卡车前进挡位数='" + C_变速箱_卡车前进挡位数 + '\'' +
                ", C_玻璃后视镜_车窗防夹手功能='" + C_玻璃后视镜_车窗防夹手功能 + '\'' +
                ", C_玻璃后视镜_车窗一键升降='" + C_玻璃后视镜_车窗一键升降 + '\'' +
                ", C_玻璃后视镜_车内化妆镜='" + C_玻璃后视镜_车内化妆镜 + '\'' +
                ", C_玻璃后视镜_第二排电动车窗='" + C_玻璃后视镜_第二排电动车窗 + '\'' +
                ", C_玻璃后视镜_第一排电动车窗='" + C_玻璃后视镜_第一排电动车窗 + '\'' +
                ", C_玻璃后视镜_多层隔音玻璃='" + C_玻璃后视镜_多层隔音玻璃 + '\'' +
                ", C_玻璃后视镜_感应雨刷功能='" + C_玻璃后视镜_感应雨刷功能 + '\'' +
                ", C_玻璃后视镜_后风挡遮阳帘='" + C_玻璃后视镜_后风挡遮阳帘 + '\'' +
                ", C_玻璃后视镜_后排侧隐私玻璃='" + C_玻璃后视镜_后排侧隐私玻璃 + '\'' +
                ", C_玻璃后视镜_后排侧遮阳帘='" + C_玻璃后视镜_后排侧遮阳帘 + '\'' +
                ", C_玻璃后视镜_后雨刷='" + C_玻璃后视镜_后雨刷 + '\'' +
                ", C_玻璃后视镜_可加热喷水嘴='" + C_玻璃后视镜_可加热喷水嘴 + '\'' +
                ", C_玻璃后视镜_流媒体外后视镜显示屏='" + C_玻璃后视镜_流媒体外后视镜显示屏 + '\'' +
                ", C_玻璃后视镜_内后视镜功能='" + C_玻璃后视镜_内后视镜功能 + '\'' +
                ", C_玻璃后视镜_外后视镜功能='" + C_玻璃后视镜_外后视镜功能 + '\'' +
                ", C_车机互联_AR实景导航='" + C_车机互联_AR实景导航 + '\'' +
                ", C_车机互联_OTA升级='" + C_车机互联_OTA升级 + '\'' +
                ", C_车机互联_V2X通讯='" + C_车机互联_V2X通讯 + '\'' +
                ", C_车机互联_车机WiFi功能='" + C_车机互联_车机WiFi功能 + '\'' +
                ", C_车机互联_车机网络='" + C_车机互联_车机网络 + '\'' +
                ", C_车机互联_车机系统='" + C_车机互联_车机系统 + '\'' +
                ", C_车机互联_车机系统存储GB='" + C_车机互联_车机系统存储GB + '\'' +
                ", C_车机互联_车机系统内存GB='" + C_车机互联_车机系统内存GB + '\'' +
                ", C_车机互联_车机芯片='" + C_车机互联_车机芯片 + '\'' +
                ", C_车机互联_车载导航地图='" + C_车机互联_车载导航地图 + '\'' +
                ", C_车机互联_道路救援呼叫='" + C_车机互联_道路救援呼叫 + '\'' +
                ", C_车机互联_多指飞屏操控='" + C_车机互联_多指飞屏操控 + '\'' +
                ", C_车机互联_副驾屏幕='" + C_车机互联_副驾屏幕 + '\'' +
                ", C_车机互联_副驾屏幕材质='" + C_车机互联_副驾屏幕材质 + '\'' +
                ", C_车机互联_副驾屏幕尺寸英寸='" + C_车机互联_副驾屏幕尺寸英寸 + '\'' +
                ", C_车机互联_副驾屏幕分辨率px='" + C_车机互联_副驾屏幕分辨率px + '\'' +
                ", C_车机互联_副驾屏幕刷新率Hz='" + C_车机互联_副驾屏幕刷新率Hz + '\'' +
                ", C_车机互联_副驾屏幕像素密度PPI='" + C_车机互联_副驾屏幕像素密度PPI + '\'' +
                ", C_车机互联_高精地图='" + C_车机互联_高精地图 + '\'' +
                ", C_车机互联_蓝牙车载电话='" + C_车机互联_蓝牙车载电话 + '\'' +
                ", C_车机互联_面部识别='" + C_车机互联_面部识别 + '\'' +
                ", C_车机互联_手机互联映射='" + C_车机互联_手机互联映射 + '\'' +
                ", C_车机互联_手势控制='" + C_车机互联_手势控制 + '\'' +
                ", C_车机互联_语音分区唤醒='" + C_车机互联_语音分区唤醒 + '\'' +
                ", C_车机互联_语音连续识别='" + C_车机互联_语音连续识别 + '\'' +
                ", C_车机互联_语音免唤醒='" + C_车机互联_语音免唤醒 + '\'' +
                ", C_车机互联_语音识别控制功能='" + C_车机互联_语音识别控制功能 + '\'' +
                ", C_车机互联_语音助手唤醒词='" + C_车机互联_语音助手唤醒词 + '\'' +
                ", C_车机互联_远程控制功能='" + C_车机互联_远程控制功能 + '\'' +
                ", C_车机互联_中控彩色屏幕='" + C_车机互联_中控彩色屏幕 + '\'' +
                ", C_车机互联_中控屏幕材质='" + C_车机互联_中控屏幕材质 + '\'' +
                ", C_车机互联_中控屏幕尺寸英寸='" + C_车机互联_中控屏幕尺寸英寸 + '\'' +
                ", C_车机互联_中控屏幕分辨率px='" + C_车机互联_中控屏幕分辨率px + '\'' +
                ", C_车机互联_中控屏幕亮度nit='" + C_车机互联_中控屏幕亮度nit + '\'' +
                ", C_车机互联_中控屏幕色彩万色='" + C_车机互联_中控屏幕色彩万色 + '\'' +
                ", C_车机互联_中控屏幕刷新率Hz='" + C_车机互联_中控屏幕刷新率Hz + '\'' +
                ", C_车机互联_中控屏幕像素密度PPI='" + C_车机互联_中控屏幕像素密度PPI + '\'' +
                ", C_车机互联_中控下屏幕材质='" + C_车机互联_中控下屏幕材质 + '\'' +
                ", C_车机互联_中控下屏幕尺寸英寸='" + C_车机互联_中控下屏幕尺寸英寸 + '\'' +
                ", C_车机互联_中控下屏幕分辨率px='" + C_车机互联_中控下屏幕分辨率px + '\'' +
                ", C_车机互联_中控下屏幕像素密度PPI='" + C_车机互联_中控下屏幕像素密度PPI + '\'' +
                ", C_车轮制动_备胎='" + C_车轮制动_备胎 + '\'' +
                ", C_车轮制动_备胎放置方式='" + C_车轮制动_备胎放置方式 + '\'' +
                ", C_车轮制动_后轮胎规格='" + C_车轮制动_后轮胎规格 + '\'' +
                ", C_车轮制动_后制动器类型='" + C_车轮制动_后制动器类型 + '\'' +
                ", C_车轮制动_轮胎规格='" + C_车轮制动_轮胎规格 + '\'' +
                ", C_车轮制动_轮胎数='" + C_车轮制动_轮胎数 + '\'' +
                ", C_车轮制动_前轮胎规格='" + C_车轮制动_前轮胎规格 + '\'' +
                ", C_车轮制动_前制动器类型='" + C_车轮制动_前制动器类型 + '\'' +
                ", C_车轮制动_驻车制动类型='" + C_车轮制动_驻车制动类型 + '\'' +
                ", C_车身_车门开启方式='" + C_车身_车门开启方式 + '\'' +
                ", C_车身_车门数='" + C_车身_车门数 + '\'' +
                ", C_车身_车型种类='" + C_车身_车型种类 + '\'' +
                ", C_车身_风阻系数Cd='" + C_车身_风阻系数Cd + '\'' +
                ", C_车身_高度mm='" + C_车身_高度mm + '\'' +
                ", C_车身_官方后备厢容积L='" + C_车身_官方后备厢容积L + '\'' +
                ", C_车身_官方前备厢容积L='" + C_车身_官方前备厢容积L + '\'' +
                ", C_车身_后轮距mm='" + C_车身_后轮距mm + '\'' +
                ", C_车身_货箱高度mm='" + C_车身_货箱高度mm + '\'' +
                ", C_车身_货箱宽度mm='" + C_车身_货箱宽度mm + '\'' +
                ", C_车身_货箱长度mm='" + C_车身_货箱长度mm + '\'' +
                ", C_车身_接近角='" + C_车身_接近角 + '\'' +
                ", C_车身_空载最小离地间隙mm='" + C_车身_空载最小离地间隙mm + '\'' +
                ", C_车身_宽度mm='" + C_车身_宽度mm + '\'' +
                ", C_车身_离去角='" + C_车身_离去角 + '\'' +
                ", C_车身_满载质量kg='" + C_车身_满载质量kg + '\'' +
                ", C_车身_满载最小离地间隙mm='" + C_车身_满载最小离地间隙mm + '\'' +
                ", C_车身_气罐容积L='" + C_车身_气罐容积L + '\'' +
                ", C_车身_牵引质量kg='" + C_车身_牵引质量kg + '\'' +
                ", C_车身_前轮距mm='" + C_车身_前轮距mm + '\'' +
                ", C_车身_实测后备厢容积L='" + C_车身_实测后备厢容积L + '\'' +
                ", C_车身_实测前备厢容积L='" + C_车身_实测前备厢容积L + '\'' +
                ", C_车身_通过角='" + C_车身_通过角 + '\'' +
                ", C_车身_油箱容积L='" + C_车身_油箱容积L + '\'' +
                ", C_车身_载重质量kg='" + C_车身_载重质量kg + '\'' +
                ", C_车身_长度mm='" + C_车身_长度mm + '\'' +
                ", C_车身_整备质量kg='" + C_车身_整备质量kg + '\'' +
                ", C_车身_轴距mm='" + C_车身_轴距mm + '\'' +
                ", C_车身_最大爬坡度='" + C_车身_最大爬坡度 + '\'' +
                ", C_车身_最小转弯半径m='" + C_车身_最小转弯半径m + '\'' +
                ", C_车身_座位数='" + C_车身_座位数 + '\'' +
                ", C_灯光功能_LED日间行车灯='" + C_灯光功能_LED日间行车灯 + '\'' +
                ", C_灯光功能_车内氛围灯='" + C_灯光功能_车内氛围灯 + '\'' +
                ", C_灯光功能_大灯功能='" + C_灯光功能_大灯功能 + '\'' +
                ", C_灯光功能_大灯清洗装置='" + C_灯光功能_大灯清洗装置 + '\'' +
                ", C_灯光功能_灯光特色功能='" + C_灯光功能_灯光特色功能 + '\'' +
                ", C_灯光功能_近光灯光源='" + C_灯光功能_近光灯光源 + '\'' +
                ", C_灯光功能_前雾灯='" + C_灯光功能_前雾灯 + '\'' +
                ", C_灯光功能_远光灯光源='" + C_灯光功能_远光灯光源 + '\'' +
                ", C_灯光功能_主动式环境氛围灯='" + C_灯光功能_主动式环境氛围灯 + '\'' +
                ", C_灯光功能_转向辅助灯='" + C_灯光功能_转向辅助灯 + '\'' +
                ", C_底盘转向_差速锁='" + C_底盘转向_差速锁 + '\'' +
                ", C_底盘转向_车体结构='" + C_底盘转向_车体结构 + '\'' +
                ", C_底盘转向_后桥描述='" + C_底盘转向_后桥描述 + '\'' +
                ", C_底盘转向_后桥速比='" + C_底盘转向_后桥速比 + '\'' +
                ", C_底盘转向_后桥允许载荷kg='" + C_底盘转向_后桥允许载荷kg + '\'' +
                ", C_底盘转向_后悬架类型='" + C_底盘转向_后悬架类型 + '\'' +
                ", C_底盘转向_缓速器类型='" + C_底盘转向_缓速器类型 + '\'' +
                ", C_底盘转向_卡车驱动形式='" + C_底盘转向_卡车驱动形式 + '\'' +
                ", C_底盘转向_可调悬架功能='" + C_底盘转向_可调悬架功能 + '\'' +
                ", C_底盘转向_可调悬架种类='" + C_底盘转向_可调悬架种类 + '\'' +
                ", C_底盘转向_客车后悬架类型='" + C_底盘转向_客车后悬架类型 + '\'' +
                ", C_底盘转向_客车前悬架类型='" + C_底盘转向_客车前悬架类型 + '\'' +
                ", C_底盘转向_前桥描述='" + C_底盘转向_前桥描述 + '\'' +
                ", C_底盘转向_前桥允许载荷kg='" + C_底盘转向_前桥允许载荷kg + '\'' +
                ", C_底盘转向_前悬架类型='" + C_底盘转向_前悬架类型 + '\'' +
                ", C_底盘转向_驱动形式='" + C_底盘转向_驱动形式 + '\'' +
                ", C_底盘转向_四驱形式='" + C_底盘转向_四驱形式 + '\'' +
                ", C_底盘转向_限滑差速器='" + C_底盘转向_限滑差速器 + '\'' +
                ", C_底盘转向_中央差速器结构='" + C_底盘转向_中央差速器结构 + '\'' +
                ", C_底盘转向_助力类型='" + C_底盘转向_助力类型 + '\'' +
                ", C_底盘转向_最大涉水深度mm='" + C_底盘转向_最大涉水深度mm + '\'' +
                ", C_电池补能_CLTC纯电续航km='" + C_电池补能_CLTC纯电续航km + '\'' +
                ", C_电池补能_CLTC综合续航km='" + C_电池补能_CLTC综合续航km + '\'' +
                ", C_电池补能_EPA纯电续航km='" + C_电池补能_EPA纯电续航km + '\'' +
                ", C_电池补能_NEDC纯电续航km='" + C_电池补能_NEDC纯电续航km + '\'' +
                ", C_电池补能_NEDC综合续航km='" + C_电池补能_NEDC综合续航km + '\'' +
                ", C_电池补能_WLTC纯电续航km='" + C_电池补能_WLTC纯电续航km + '\'' +
                ", C_电池补能_WLTC综合续航km='" + C_电池补能_WLTC综合续航km + '\'' +
                ", C_电池补能_百公里耗电量kWh100km='" + C_电池补能_百公里耗电量kWh100km + '\'' +
                ", C_电池补能_车辆充电口='" + C_电池补能_车辆充电口 + '\'' +
                ", C_电池补能_车辆换电='" + C_电池补能_车辆换电 + '\'' +
                ", C_电池补能_电池电量kWh='" + C_电池补能_电池电量kWh + '\'' +
                ", C_电池补能_电池类型='" + C_电池补能_电池类型 + '\'' +
                ", C_电池补能_电池能量密度Whkg='" + C_电池补能_电池能量密度Whkg + '\'' +
                ", C_电池补能_电池温度管理='" + C_电池补能_电池温度管理 + '\'' +
                ", C_电池补能_电池组质保='" + C_电池补能_电池组质保 + '\'' +
                ", C_电池补能_电芯品牌='" + C_电池补能_电芯品牌 + '\'' +
                ", C_电池补能_对外放电功率='" + C_电池补能_对外放电功率 + '\'' +
                ", C_电池补能_对外放电功能='" + C_电池补能_对外放电功能 + '\'' +
                ", C_电池补能_高压快充平台='" + C_电池补能_高压快充平台 + '\'' +
                ", C_电池补能_换电时间min='" + C_电池补能_换电时间min + '\'' +
                ", C_电池补能_家用充电桩='" + C_电池补能_家用充电桩 + '\'' +
                ", C_电池补能_快充电量='" + C_电池补能_快充电量 + '\'' +
                ", C_电池补能_快充功率kW='" + C_电池补能_快充功率kW + '\'' +
                ", C_电池补能_快充口位置='" + C_电池补能_快充口位置 + '\'' +
                ", C_电池补能_快充时间h='" + C_电池补能_快充时间h + '\'' +
                ", C_电池补能_快充时间min='" + C_电池补能_快充时间min + '\'' +
                ", C_电池补能_慢充电量='" + C_电池补能_慢充电量 + '\'' +
                ", C_电池补能_慢充功率kW='" + C_电池补能_慢充功率kW + '\'' +
                ", C_电池补能_慢充口位置='" + C_电池补能_慢充口位置 + '\'' +
                ", C_电池补能_慢充时间h='" + C_电池补能_慢充时间h + '\'' +
                ", C_电池补能_首任车主电池组质保='" + C_电池补能_首任车主电池组质保 + '\'' +
                ", C_电池补能_随车充电枪='" + C_电池补能_随车充电枪 + '\'' +
                ", C_电动机_电动机品牌='" + C_电动机_电动机品牌 + '\'' +
                ", C_电动机_电动机型号='" + C_电动机_电动机型号 + '\'' +
                ", C_电动机_电动机总功率kW='" + C_电动机_电动机总功率kW + '\'' +
                ", C_电动机_电动机总马力Ps='" + C_电动机_电动机总马力Ps + '\'' +
                ", C_电动机_电动机总扭矩Nm='" + C_电动机_电动机总扭矩Nm + '\'' +
                ", C_电动机_电机布局='" + C_电动机_电机布局 + '\'' +
                ", C_电动机_电机类型='" + C_电动机_电机类型 + '\'' +
                ", C_电动机_后电动机最大功率kW='" + C_电动机_后电动机最大功率kW + '\'' +
                ", C_电动机_后电动机最大扭矩Nm='" + C_电动机_后电动机最大扭矩Nm + '\'' +
                ", C_电动机_前电动机最大功率kW='" + C_电动机_前电动机最大功率kW + '\'' +
                ", C_电动机_前电动机最大扭矩Nm='" + C_电动机_前电动机最大扭矩Nm + '\'' +
                ", C_电动机_驱动电机数='" + C_电动机_驱动电机数 + '\'' +
                ", C_电动机_系统综合功率kW='" + C_电动机_系统综合功率kW + '\'' +
                ", C_电动机_系统综合马力Ps='" + C_电动机_系统综合马力Ps + '\'' +
                ", C_电动机_系统综合扭矩Nm='" + C_电动机_系统综合扭矩Nm + '\'' +
                ", C_发动机_发动机布局='" + C_发动机_发动机布局 + '\'' +
                ", C_发动机_发动机型号='" + C_发动机_发动机型号 + '\'' +
                ", C_发动机_缸盖材料='" + C_发动机_缸盖材料 + '\'' +
                ", C_发动机_缸体材料='" + C_发动机_缸体材料 + '\'' +
                ", C_发动机_供油方式='" + C_发动机_供油方式 + '\'' +
                ", C_发动机_环保标准='" + C_发动机_环保标准 + '\'' +
                ", C_发动机_进气形式='" + C_发动机_进气形式 + '\'' +
                ", C_发动机_每缸气门数个='" + C_发动机_每缸气门数个 + '\'' +
                ", C_发动机_排量L='" + C_发动机_排量L + '\'' +
                ", C_发动机_排量mL='" + C_发动机_排量mL + '\'' +
                ", C_发动机_配气机构='" + C_发动机_配气机构 + '\'' +
                ", C_发动机_气缸排列形式='" + C_发动机_气缸排列形式 + '\'' +
                ", C_发动机_气缸数个='" + C_发动机_气缸数个 + '\'' +
                ", C_发动机_燃油标号='" + C_发动机_燃油标号 + '\'' +
                ", C_发动机_压缩比='" + C_发动机_压缩比 + '\'' +
                ", C_发动机_最大功率kW='" + C_发动机_最大功率kW + '\'' +
                ", C_发动机_最大功率转速rpm='" + C_发动机_最大功率转速rpm + '\'' +
                ", C_发动机_最大净功率kW='" + C_发动机_最大净功率kW + '\'' +
                ", C_发动机_最大马力Ps='" + C_发动机_最大马力Ps + '\'' +
                ", C_发动机_最大扭矩Nm='" + C_发动机_最大扭矩Nm + '\'' +
                ", C_发动机_最大扭矩转速rpm='" + C_发动机_最大扭矩转速rpm + '\'' +
                ", C_辅助操控配置_倒车车侧预警系统='" + C_辅助操控配置_倒车车侧预警系统 + '\'' +
                ", C_辅助操控配置_低速四驱='" + C_辅助操控配置_低速四驱 + '\'' +
                ", C_辅助操控配置_底盘透视='" + C_辅助操控配置_底盘透视 + '\'' +
                ", C_辅助操控配置_陡坡缓降='" + C_辅助操控配置_陡坡缓降 + '\'' +
                ", C_辅助操控配置_发动机启停='" + C_辅助操控配置_发动机启停 + '\'' +
                ", C_辅助操控配置_防侧翻系统='" + C_辅助操控配置_防侧翻系统 + '\'' +
                ", C_辅助操控配置_后驻车雷达='" + C_辅助操控配置_后驻车雷达 + '\'' +
                ", C_辅助操控配置_驾驶辅助影像='" + C_辅助操控配置_驾驶辅助影像 + '\'' +
                ", C_辅助操控配置_驾驶模式选择='" + C_辅助操控配置_驾驶模式选择 + '\'' +
                ", C_辅助操控配置_开门碰撞预警='" + C_辅助操控配置_开门碰撞预警 + '\'' +
                ", C_辅助操控配置_可变转向比='" + C_辅助操控配置_可变转向比 + '\'' +
                ", C_辅助操控配置_疲劳提醒='" + C_辅助操控配置_疲劳提醒 + '\'' +
                ", C_辅助操控配置_前驻车雷达='" + C_辅助操控配置_前驻车雷达 + '\'' +
                ", C_辅助操控配置_蠕行模式='" + C_辅助操控配置_蠕行模式 + '\'' +
                ", C_辅助操控配置_上坡辅助='" + C_辅助操控配置_上坡辅助 + '\'' +
                ", C_辅助操控配置_涉水感应系统='" + C_辅助操控配置_涉水感应系统 + '\'' +
                ", C_辅助操控配置_坦克转弯='" + C_辅助操控配置_坦克转弯 + '\'' +
                ", C_辅助操控配置_巡航系统='" + C_辅助操控配置_巡航系统 + '\'' +
                ", C_辅助操控配置_遥控泊车='" + C_辅助操控配置_遥控泊车 + '\'' +
                ", C_辅助操控配置_夜视系统='" + C_辅助操控配置_夜视系统 + '\'' +
                ", C_辅助操控配置_远程召唤='" + C_辅助操控配置_远程召唤 + '\'' +
                ", C_辅助操控配置_整体主动转向系统='" + C_辅助操控配置_整体主动转向系统 + '\'' +
                ", C_辅助操控配置_自动泊车='" + C_辅助操控配置_自动泊车 + '\'' +
                ", C_辅助操控配置_自动驻车='" + C_辅助操控配置_自动驻车 + '\'' +
                ", C_辅助驾驶功能_并线辅助BSMBSD='" + C_辅助驾驶功能_并线辅助BSMBSD + '\'' +
                ", C_辅助驾驶功能_车道保持LKAS='" + C_辅助驾驶功能_车道保持LKAS + '\'' +
                ", C_辅助驾驶功能_车道居中保持='" + C_辅助驾驶功能_车道居中保持 + '\'' +
                ", C_辅助驾驶功能_车道偏离预警LDWS='" + C_辅助驾驶功能_车道偏离预警LDWS + '\'' +
                ", C_辅助驾驶功能_城市辅助驾驶='" + C_辅助驾驶功能_城市辅助驾驶 + '\'' +
                ", C_辅助驾驶功能_倒车循迹='" + C_辅助驾驶功能_倒车循迹 + '\'' +
                ", C_辅助驾驶功能_道路交通标识识别='" + C_辅助驾驶功能_道路交通标识识别 + '\'' +
                ", C_辅助驾驶功能_高速辅助驾驶='" + C_辅助驾驶功能_高速辅助驾驶 + '\'' +
                ", C_辅助驾驶功能_后方碰撞预警='" + C_辅助驾驶功能_后方碰撞预警 + '\'' +
                ", C_辅助驾驶功能_前方碰撞预警='" + C_辅助驾驶功能_前方碰撞预警 + '\'' +
                ", C_辅助驾驶功能_匝道自动驶出入='" + C_辅助驾驶功能_匝道自动驶出入 + '\'' +
                ", C_辅助驾驶功能_主动刹车='" + C_辅助驾驶功能_主动刹车 + '\'' +
                ", C_辅助驾驶功能_自动变道辅助='" + C_辅助驾驶功能_自动变道辅助 + '\'' +
                ", C_辅助驾驶硬件_超声波雷达='" + C_辅助驾驶硬件_超声波雷达 + '\'' +
                ", C_辅助驾驶硬件_车内摄像头='" + C_辅助驾驶硬件_车内摄像头 + '\'' +
                ", C_辅助驾驶硬件_辅助驾驶系统='" + C_辅助驾驶硬件_辅助驾驶系统 + '\'' +
                ", C_辅助驾驶硬件_辅助驾驶芯片='" + C_辅助驾驶硬件_辅助驾驶芯片 + '\'' +
                ", C_辅助驾驶硬件_毫米波雷达='" + C_辅助驾驶硬件_毫米波雷达 + '\'' +
                ", C_辅助驾驶硬件_环境感知摄像头='" + C_辅助驾驶硬件_环境感知摄像头 + '\'' +
                ", C_辅助驾驶硬件_环境感知摄像头像素万='" + C_辅助驾驶硬件_环境感知摄像头像素万 + '\'' +
                ", C_辅助驾驶硬件_环视摄像头='" + C_辅助驾驶硬件_环视摄像头 + '\'' +
                ", C_辅助驾驶硬件_环视摄像头像素万='" + C_辅助驾驶硬件_环视摄像头像素万 + '\'' +
                ", C_辅助驾驶硬件_激光雷达10反射率探测距离m='" + C_辅助驾驶硬件_激光雷达10反射率探测距离m + '\'' +
                ", C_辅助驾驶硬件_激光雷达点云数量万秒='" + C_辅助驾驶硬件_激光雷达点云数量万秒 + '\'' +
                ", C_辅助驾驶硬件_激光雷达品牌='" + C_辅助驾驶硬件_激光雷达品牌 + '\'' +
                ", C_辅助驾驶硬件_激光雷达数量='" + C_辅助驾驶硬件_激光雷达数量 + '\'' +
                ", C_辅助驾驶硬件_激光雷达线数='" + C_辅助驾驶硬件_激光雷达线数 + '\'' +
                ", C_辅助驾驶硬件_激光雷达型号='" + C_辅助驾驶硬件_激光雷达型号 + '\'' +
                ", C_辅助驾驶硬件_激光雷达最远探测距离m='" + C_辅助驾驶硬件_激光雷达最远探测距离m + '\'' +
                ", C_辅助驾驶硬件_驾驶辅助级别='" + C_辅助驾驶硬件_驾驶辅助级别 + '\'' +
                ", C_辅助驾驶硬件_前方感知摄像头类型='" + C_辅助驾驶硬件_前方感知摄像头类型 + '\'' +
                ", C_辅助驾驶硬件_前方感知摄像头像素万='" + C_辅助驾驶硬件_前方感知摄像头像素万 + '\'' +
                ", C_辅助驾驶硬件_芯片算力='" + C_辅助驾驶硬件_芯片算力 + '\'' +
                ", C_基本信息_CLTC纯电续航km='" + C_基本信息_CLTC纯电续航km + '\'' +
                ", C_基本信息_CLTC综合油耗L100km='" + C_基本信息_CLTC综合油耗L100km + '\'' +
                ", C_基本信息_EPA纯电续航km='" + C_基本信息_EPA纯电续航km + '\'' +
                ", C_基本信息_NEDC纯电续航km='" + C_基本信息_NEDC纯电续航km + '\'' +
                ", C_基本信息_NEDC综合油耗L100km='" + C_基本信息_NEDC综合油耗L100km + '\'' +
                ", C_基本信息_WLTC纯电续航km='" + C_基本信息_WLTC纯电续航km + '\'' +
                ", C_基本信息_WLTC综合油耗L100km='" + C_基本信息_WLTC综合油耗L100km + '\'' +
                ", C_基本信息_变速箱='" + C_基本信息_变速箱 + '\'' +
                ", C_基本信息_厂商='" + C_基本信息_厂商 + '\'' +
                ", C_基本信息_厂商指导价='" + C_基本信息_厂商指导价 + '\'' +
                ", C_基本信息_车款名称='" + C_基本信息_车款名称 + '\'' +
                ", C_基本信息_车身结构='" + C_基本信息_车身结构 + '\'' +
                ", C_基本信息_城市参考价='" + C_基本信息_城市参考价 + '\'' +
                ", C_基本信息_电动机Ps='" + C_基本信息_电动机Ps + '\'' +
                ", C_基本信息_发动机='" + C_基本信息_发动机 + '\'' +
                ", C_基本信息_官方0100kmh加速s='" + C_基本信息_官方0100kmh加速s + '\'' +
                ", C_基本信息_环保标准='" + C_基本信息_环保标准 + '\'' +
                ", C_基本信息_级别='" + C_基本信息_级别 + '\'' +
                ", C_基本信息_快充电量='" + C_基本信息_快充电量 + '\'' +
                ", C_基本信息_快充时间h='" + C_基本信息_快充时间h + '\'' +
                ", C_基本信息_亏电状态油耗L100km='" + C_基本信息_亏电状态油耗L100km + '\'' +
                ", C_基本信息_慢充电量='" + C_基本信息_慢充电量 + '\'' +
                ", C_基本信息_慢充时间h='" + C_基本信息_慢充时间h + '\'' +
                ", C_基本信息_内饰颜色='" + C_基本信息_内饰颜色 + '\'' +
                ", C_基本信息_能源类型='" + C_基本信息_能源类型 + '\'' +
                ", C_基本信息_上市时间='" + C_基本信息_上市时间 + '\'' +
                ", C_基本信息_首任车主质保政策='" + C_基本信息_首任车主质保政策 + '\'' +
                ", C_基本信息_外观颜色='" + C_基本信息_外观颜色 + '\'' +
                ", C_基本信息_长宽高mm='" + C_基本信息_长宽高mm + '\'' +
                ", C_基本信息_整车质保='" + C_基本信息_整车质保 + '\'' +
                ", C_基本信息_最大功率最大扭矩='" + C_基本信息_最大功率最大扭矩 + '\'' +
                ", C_基本信息_最高车速kmh='" + C_基本信息_最高车速kmh + '\'' +
                ", C_空调制冷_车内PM25过滤装置='" + C_空调制冷_车内PM25过滤装置 + '\'' +
                ", C_空调制冷_车载冰箱='" + C_空调制冷_车载冰箱 + '\'' +
                ", C_空调制冷_车载空气净化器='" + C_空调制冷_车载空气净化器 + '\'' +
                ", C_空调制冷_第二排空调='" + C_空调制冷_第二排空调 + '\'' +
                ", C_空调制冷_第三排空调='" + C_空调制冷_第三排空调 + '\'' +
                ", C_空调制冷_第一排空调='" + C_空调制冷_第一排空调 + '\'' +
                ", C_空调制冷_负离子发生器='" + C_空调制冷_负离子发生器 + '\'' +
                ", C_空调制冷_空气质量监测='" + C_空调制冷_空气质量监测 + '\'' +
                ", C_空调制冷_热泵空调='" + C_空调制冷_热泵空调 + '\'' +
                ", C_空调制冷_香氛系统='" + C_空调制冷_香氛系统 + '\'' +
                ", C_内部配置_ETC装置='" + C_内部配置_ETC装置 + '\'' +
                ", C_内部配置_HUD抬头显示='" + C_内部配置_HUD抬头显示 + '\'' +
                ", C_内部配置_单踏板模式='" + C_内部配置_单踏板模式 + '\'' +
                ", C_内部配置_电动可调踏板='" + C_内部配置_电动可调踏板 + '\'' +
                ", C_内部配置_多功能方向盘='" + C_内部配置_多功能方向盘 + '\'' +
                ", C_内部配置_方向盘材质='" + C_内部配置_方向盘材质 + '\'' +
                ", C_内部配置_方向盘调节='" + C_内部配置_方向盘调节 + '\'' +
                ", C_内部配置_方向盘换挡='" + C_内部配置_方向盘换挡 + '\'' +
                ", C_内部配置_方向盘加热='" + C_内部配置_方向盘加热 + '\'' +
                ", C_内部配置_换挡形式='" + C_内部配置_换挡形式 + '\'' +
                ", C_内部配置_内置行车记录仪='" + C_内部配置_内置行车记录仪 + '\'' +
                ", C_内部配置_全液晶仪表盘='" + C_内部配置_全液晶仪表盘 + '\'' +
                ", C_内部配置_手机无线充电='" + C_内部配置_手机无线充电 + '\'' +
                ", C_内部配置_手机无线最大充电功率W='" + C_内部配置_手机无线最大充电功率W + '\'' +
                ", C_内部配置_行车电脑显示屏='" + C_内部配置_行车电脑显示屏 + '\'' +
                ", C_内部配置_仪表屏幕材质='" + C_内部配置_仪表屏幕材质 + '\'' +
                ", C_内部配置_仪表屏幕尺寸英寸='" + C_内部配置_仪表屏幕尺寸英寸 + '\'' +
                ", C_内部配置_仪表屏幕分辨率px='" + C_内部配置_仪表屏幕分辨率px + '\'' +
                ", C_内部配置_仪表屏幕像素密度PPI='" + C_内部配置_仪表屏幕像素密度PPI + '\'' +
                ", C_内部配置_主动降噪='" + C_内部配置_主动降噪 + '\'' +
                ", C_外部配置_侧滑门='" + C_外部配置_侧滑门 + '\'' +
                ", C_外部配置_车侧脚踏板='" + C_外部配置_车侧脚踏板 + '\'' +
                ", C_外部配置_车顶行李架='" + C_外部配置_车顶行李架 + '\'' +
                ", C_外部配置_低速行车警示音='" + C_外部配置_低速行车警示音 + '\'' +
                ", C_外部配置_电动扰流板='" + C_外部配置_电动扰流板 + '\'' +
                ", C_外部配置_电动尾门='" + C_外部配置_电动尾门 + '\'' +
                ", C_外部配置_电吸门='" + C_外部配置_电吸门 + '\'' +
                ", C_外部配置_感应尾门='" + C_外部配置_感应尾门 + '\'' +
                ", C_外部配置_光感天幕='" + C_外部配置_光感天幕 + '\'' +
                ", C_外部配置_货箱宝='" + C_外部配置_货箱宝 + '\'' +
                ", C_外部配置_轮圈材质='" + C_外部配置_轮圈材质 + '\'' +
                ", C_外部配置_哨兵千里眼模式='" + C_外部配置_哨兵千里眼模式 + '\'' +
                ", C_外部配置_天窗类型='" + C_外部配置_天窗类型 + '\'' +
                ", C_外部配置_拖车钩='" + C_外部配置_拖车钩 + '\'' +
                ", C_外部配置_拖车取电口='" + C_外部配置_拖车取电口 + '\'' +
                ", C_外部配置_尾门玻璃独立开启='" + C_外部配置_尾门玻璃独立开启 + '\'' +
                ", C_外部配置_尾门位置记忆='" + C_外部配置_尾门位置记忆 + '\'' +
                ", C_外部配置_无框车门='" + C_外部配置_无框车门 + '\'' +
                ", C_外部配置_无钥匙进入='" + C_外部配置_无钥匙进入 + '\'' +
                ", C_外部配置_无钥匙启动='" + C_外部配置_无钥匙启动 + '\'' +
                ", C_外部配置_钥匙类型='" + C_外部配置_钥匙类型 + '\'' +
                ", C_外部配置_隐藏电动门把手='" + C_外部配置_隐藏电动门把手 + '\'' +
                ", C_外部配置_运动外观套件='" + C_外部配置_运动外观套件 + '\'' +
                ", C_外部配置_整车无线充电='" + C_外部配置_整车无线充电 + '\'' +
                ", C_外部配置_主动闭合式进气格栅='" + C_外部配置_主动闭合式进气格栅 + '\'' +
                ", C_外部配置_自动开合车门='" + C_外部配置_自动开合车门 + '\'' +
                ", C_影音娱乐_USBTypeC接口数量='" + C_影音娱乐_USBTypeC接口数量 + '\'' +
                ", C_影音娱乐_车内娱乐功能='" + C_影音娱乐_车内娱乐功能 + '\'' +
                ", C_影音娱乐_车载APP应用市场='" + C_影音娱乐_车载APP应用市场 + '\'' +
                ", C_影音娱乐_车载CDDVD='" + C_影音娱乐_车载CDDVD + '\'' +
                ", C_影音娱乐_多媒体充电接口='" + C_影音娱乐_多媒体充电接口 + '\'' +
                ", C_影音娱乐_分屏功能='" + C_影音娱乐_分屏功能 + '\'' +
                ", C_影音娱乐_后排多媒体屏幕材质='" + C_影音娱乐_后排多媒体屏幕材质 + '\'' +
                ", C_影音娱乐_后排多媒体屏幕尺寸英寸='" + C_影音娱乐_后排多媒体屏幕尺寸英寸 + '\'' +
                ", C_影音娱乐_后排多媒体屏幕分辨率px='" + C_影音娱乐_后排多媒体屏幕分辨率px + '\'' +
                ", C_影音娱乐_后排多媒体屏幕数量='" + C_影音娱乐_后排多媒体屏幕数量 + '\'' +
                ", C_影音娱乐_后排多媒体屏幕刷新率Hz='" + C_影音娱乐_后排多媒体屏幕刷新率Hz + '\'' +
                ", C_影音娱乐_后排多媒体屏幕像素密度PPI='" + C_影音娱乐_后排多媒体屏幕像素密度PPI + '\'' +
                ", C_影音娱乐_后排控制多媒体='" + C_影音娱乐_后排控制多媒体 + '\'' +
                ", C_影音娱乐_模拟声浪='" + C_影音娱乐_模拟声浪 + '\'' +
                ", C_影音娱乐_行李厢电源接口='" + C_影音娱乐_行李厢电源接口 + '\'' +
                ", C_影音娱乐_扬声器数量='" + C_影音娱乐_扬声器数量 + '\'' +
                ", C_影音娱乐_音响品牌='" + C_影音娱乐_音响品牌 + '\'' +
                ", C_影音娱乐_座舱220V230V电源='" + C_影音娱乐_座舱220V230V电源 + '\'' +
                ", C_主动安全_ABS防抱死='" + C_主动安全_ABS防抱死 + '\'' +
                ", C_主动安全_安全带未系提醒='" + C_主动安全_安全带未系提醒 + '\'' +
                ", C_主动安全_车内生物监测='" + C_主动安全_车内生物监测 + '\'' +
                ", C_主动安全_车身稳定控制ESPDSCVSC等='" + C_主动安全_车身稳定控制ESPDSCVSC等 + '\'' +
                ", C_主动安全_牵引力控制ASRTCSTRC等='" + C_主动安全_牵引力控制ASRTCSTRC等 + '\'' +
                ", C_主动安全_胎压监测='" + C_主动安全_胎压监测 + '\'' +
                ", C_主动安全_制动辅助BAEBABAS等='" + C_主动安全_制动辅助BAEBABAS等 + '\'' +
                ", C_主动安全_制动力分配EBDCBC等='" + C_主动安全_制动力分配EBDCBC等 + '\'' +
                ", C_座椅配置_第二排座椅电动调节='" + C_座椅配置_第二排座椅电动调节 + '\'' +
                ", C_座椅配置_第二排座椅调节方式='" + C_座椅配置_第二排座椅调节方式 + '\'' +
                ", C_座椅配置_第二排座椅功能='" + C_座椅配置_第二排座椅功能 + '\'' +
                ", C_座椅配置_第三排座椅电动调节='" + C_座椅配置_第三排座椅电动调节 + '\'' +
                ", C_座椅配置_第三排座椅调节方式='" + C_座椅配置_第三排座椅调节方式 + '\'' +
                ", C_座椅配置_第三排座椅功能='" + C_座椅配置_第三排座椅功能 + '\'' +
                ", C_座椅配置_第一排座椅功能='" + C_座椅配置_第一排座椅功能 + '\'' +
                ", C_座椅配置_电动脚托='" + C_座椅配置_电动脚托 + '\'' +
                ", C_座椅配置_福祉座椅='" + C_座椅配置_福祉座椅 + '\'' +
                ", C_座椅配置_副驾座椅电动调节='" + C_座椅配置_副驾座椅电动调节 + '\'' +
                ", C_座椅配置_副驾座椅调节方式='" + C_座椅配置_副驾座椅调节方式 + '\'' +
                ", C_座椅配置_后排杯架='" + C_座椅配置_后排杯架 + '\'' +
                ", C_座椅配置_后排折叠桌板='" + C_座椅配置_后排折叠桌板 + '\'' +
                ", C_座椅配置_后排座椅电动放倒='" + C_座椅配置_后排座椅电动放倒 + '\'' +
                ", C_座椅配置_后排座椅放倒方式='" + C_座椅配置_后排座椅放倒方式 + '\'' +
                ", C_座椅配置_加热制冷杯架='" + C_座椅配置_加热制冷杯架 + '\'' +
                ", C_座椅配置_老板键='" + C_座椅配置_老板键 + '\'' +
                ", C_座椅配置_零重力座椅功能='" + C_座椅配置_零重力座椅功能 + '\'' +
                ", C_座椅配置_运动风格座椅='" + C_座椅配置_运动风格座椅 + '\'' +
                ", C_座椅配置_中央扶手='" + C_座椅配置_中央扶手 + '\'' +
                ", C_座椅配置_主驾座椅电动调节='" + C_座椅配置_主驾座椅电动调节 + '\'' +
                ", C_座椅配置_主驾座椅调节方式='" + C_座椅配置_主驾座椅调节方式 + '\'' +
                ", C_座椅配置_座椅布局='" + C_座椅配置_座椅布局 + '\'' +
                ", C_座椅配置_座椅材质='" + C_座椅配置_座椅材质 + '\'' +
                '}';
    }

    private int C_ID;

    private String C_备注;
    private String C_备注时间;

    public String getC_备注() {
        return C_备注;
    }

    public void setC_备注(String c_备注) {
        C_备注 = c_备注;
    }

    public String getC_备注时间() {
        return C_备注时间;
    }

    public void setC_备注时间(String c_备注时间) {
        C_备注时间 = c_备注时间;
    }

    private String C_version_id;
    private String C_source;

    public String getC_source() {
        return C_source;
    }

    public void setC_source(String c_source) {
        C_source = c_source;
    }

    private String C_被动安全_被动行人保护="空";
    private String C_被动安全_侧安全气帘="空";
    private String C_被动安全_第二排侧气囊="空";
    private String C_被动安全_第二排正向气囊="空";
    private String C_被动安全_第一排侧气囊="空";
    private String C_被动安全_儿童座椅接口="空";
    private String C_被动安全_副驾驶安全气囊="空";
    private String C_被动安全_副驾驶座垫式气囊="空";
    private String C_被动安全_后排安全带式气囊="空";
    private String C_被动安全_后排座椅防下滑气囊="空";
    private String C_被动安全_缺气保用轮胎="空";
    private String C_被动安全_膝部气囊="空";
    private String C_被动安全_中央安全气囊="空";
    private String C_被动安全_主驾驶安全气囊="空";
    private String C_变速箱_变速箱类型="空";
    private String C_变速箱_变速箱描述="空";
    private String C_变速箱_挡位数="空";
    private String C_变速箱_卡车倒退挡位数="空";
    private String C_变速箱_卡车前进挡位数="空";
    private String C_玻璃后视镜_车窗防夹手功能="空";
    private String C_玻璃后视镜_车窗一键升降="空";
    private String C_玻璃后视镜_车内化妆镜="空";
    private String C_玻璃后视镜_第二排电动车窗="空";
    private String C_玻璃后视镜_第一排电动车窗="空";
    private String C_玻璃后视镜_多层隔音玻璃="空";
    private String C_玻璃后视镜_感应雨刷功能="空";
    private String C_玻璃后视镜_后风挡遮阳帘="空";
    private String C_玻璃后视镜_后排侧隐私玻璃="空";
    private String C_玻璃后视镜_后排侧遮阳帘="空";
    private String C_玻璃后视镜_后雨刷="空";
    private String C_玻璃后视镜_可加热喷水嘴="空";
    private String C_玻璃后视镜_流媒体外后视镜显示屏="空";
    private String C_玻璃后视镜_内后视镜功能="空";
    private String C_玻璃后视镜_外后视镜功能="空";
    private String C_车机互联_AR实景导航="空";
    private String C_车机互联_OTA升级="空";
    private String C_车机互联_V2X通讯="空";
    private String C_车机互联_车机WiFi功能="空";
    private String C_车机互联_车机网络="空";
    private String C_车机互联_车机系统="空";
    private String C_车机互联_车机系统存储GB="空";
    private String C_车机互联_车机系统内存GB="空";
    private String C_车机互联_车机芯片="空";
    private String C_车机互联_车载导航地图="空";
    private String C_车机互联_道路救援呼叫="空";
    private String C_车机互联_多指飞屏操控="空";
    private String C_车机互联_副驾屏幕="空";
    private String C_车机互联_副驾屏幕材质="空";
    private String C_车机互联_副驾屏幕尺寸英寸="空";
    private String C_车机互联_副驾屏幕分辨率px="空";
    private String C_车机互联_副驾屏幕刷新率Hz="空";
    private String C_车机互联_副驾屏幕像素密度PPI="空";
    private String C_车机互联_高精地图="空";
    private String C_车机互联_蓝牙车载电话="空";
    private String C_车机互联_面部识别="空";
    private String C_车机互联_手机互联映射="空";
    private String C_车机互联_手势控制="空";
    private String C_车机互联_语音分区唤醒="空";
    private String C_车机互联_语音连续识别="空";
    private String C_车机互联_语音免唤醒="空";
    private String C_车机互联_语音识别控制功能="空";
    private String C_车机互联_语音助手唤醒词="空";
    private String C_车机互联_远程控制功能="空";
    private String C_车机互联_中控彩色屏幕="空";
    private String C_车机互联_中控屏幕材质="空";
    private String C_车机互联_中控屏幕尺寸英寸="空";
    private String C_车机互联_中控屏幕分辨率px="空";
    private String C_车机互联_中控屏幕亮度nit="空";
    private String C_车机互联_中控屏幕色彩万色="空";
    private String C_车机互联_中控屏幕刷新率Hz="空";
    private String C_车机互联_中控屏幕像素密度PPI="空";
    private String C_车机互联_中控下屏幕材质="空";
    private String C_车机互联_中控下屏幕尺寸英寸="空";
    private String C_车机互联_中控下屏幕分辨率px="空";
    private String C_车机互联_中控下屏幕像素密度PPI="空";
    private String C_车轮制动_备胎="空";
    private String C_车轮制动_备胎放置方式="空";
    private String C_车轮制动_后轮胎规格="空";
    private String C_车轮制动_后制动器类型="空";
    private String C_车轮制动_轮胎规格="空";
    private String C_车轮制动_轮胎数="空";
    private String C_车轮制动_前轮胎规格="空";
    private String C_车轮制动_前制动器类型="空";
    private String C_车轮制动_驻车制动类型="空";
    private String C_车身_车门开启方式="空";
    private String C_车身_车门数="空";
    private String C_车身_车型种类="空";
    private String C_车身_风阻系数Cd="空";
    private String C_车身_高度mm="空";
    private String C_车身_官方后备厢容积L="空";
    private String C_车身_官方前备厢容积L="空";
    private String C_车身_后轮距mm="空";
    private String C_车身_货箱高度mm="空";
    private String C_车身_货箱宽度mm="空";
    private String C_车身_货箱长度mm="空";
    private String C_车身_接近角="空";
    private String C_车身_空载最小离地间隙mm="空";
    private String C_车身_宽度mm="空";
    private String C_车身_离去角="空";
    private String C_车身_满载质量kg="空";
    private String C_车身_满载最小离地间隙mm="空";
    private String C_车身_气罐容积L="空";
    private String C_车身_牵引质量kg="空";
    private String C_车身_前轮距mm="空";
    private String C_车身_实测后备厢容积L="空";
    private String C_车身_实测前备厢容积L="空";
    private String C_车身_通过角="空";
    private String C_车身_油箱容积L="空";
    private String C_车身_载重质量kg="空";
    private String C_车身_长度mm="空";
    private String C_车身_整备质量kg="空";
    private String C_车身_轴距mm="空";
    private String C_车身_最大爬坡度="空";
    private String C_车身_最小转弯半径m="空";
    private String C_车身_座位数="空";
    private String C_灯光功能_LED日间行车灯="空";
    private String C_灯光功能_车内氛围灯="空";
    private String C_灯光功能_大灯功能="空";
    private String C_灯光功能_大灯清洗装置="空";
    private String C_灯光功能_灯光特色功能="空";
    private String C_灯光功能_近光灯光源="空";
    private String C_灯光功能_前雾灯="空";
    private String C_灯光功能_远光灯光源="空";
    private String C_灯光功能_主动式环境氛围灯="空";
    private String C_灯光功能_转向辅助灯="空";
    private String C_底盘转向_差速锁="空";
    private String C_底盘转向_车体结构="空";
    private String C_底盘转向_后桥描述="空";
    private String C_底盘转向_后桥速比="空";
    private String C_底盘转向_后桥允许载荷kg="空";
    private String C_底盘转向_后悬架类型="空";
    private String C_底盘转向_缓速器类型="空";
    private String C_底盘转向_卡车驱动形式="空";
    private String C_底盘转向_可调悬架功能="空";
    private String C_底盘转向_可调悬架种类="空";
    private String C_底盘转向_客车后悬架类型="空";
    private String C_底盘转向_客车前悬架类型="空";
    private String C_底盘转向_前桥描述="空";
    private String C_底盘转向_前桥允许载荷kg="空";
    private String C_底盘转向_前悬架类型="空";
    private String C_底盘转向_驱动形式="空";
    private String C_底盘转向_四驱形式="空";
    private String C_底盘转向_限滑差速器="空";
    private String C_底盘转向_中央差速器结构="空";
    private String C_底盘转向_助力类型="空";
    private String C_底盘转向_最大涉水深度mm="空";
    private String C_电池补能_CLTC纯电续航km="空";
    private String C_电池补能_CLTC综合续航km="空";
    private String C_电池补能_EPA纯电续航km="空";
    private String C_电池补能_NEDC纯电续航km="空";
    private String C_电池补能_NEDC综合续航km="空";
    private String C_电池补能_WLTC纯电续航km="空";
    private String C_电池补能_WLTC综合续航km="空";
    private String C_电池补能_百公里耗电量kWh100km="空";
    private String C_电池补能_车辆充电口="空";
    private String C_电池补能_车辆换电="空";
    private String C_电池补能_电池电量kWh="空";
    private String C_电池补能_电池类型="空";
    private String C_电池补能_电池能量密度Whkg="空";
    private String C_电池补能_电池温度管理="空";
    private String C_电池补能_电池组质保="空";
    private String C_电池补能_电芯品牌="空";
    private String C_电池补能_对外放电功率="空";
    private String C_电池补能_对外放电功能="空";
    private String C_电池补能_高压快充平台="空";
    private String C_电池补能_换电时间min="空";
    private String C_电池补能_家用充电桩="空";
    private String C_电池补能_快充电量="空";
    private String C_电池补能_快充功率kW="空";
    private String C_电池补能_快充口位置="空";
    private String C_电池补能_快充时间h="空";
    private String C_电池补能_快充时间min="空";
    private String C_电池补能_慢充电量="空";
    private String C_电池补能_慢充功率kW="空";
    private String C_电池补能_慢充口位置="空";
    private String C_电池补能_慢充时间h="空";
    private String C_电池补能_首任车主电池组质保="空";
    private String C_电池补能_随车充电枪="空";
    private String C_电动机_电动机品牌="空";
    private String C_电动机_电动机型号="空";
    private String C_电动机_电动机总功率kW="空";
    private String C_电动机_电动机总马力Ps="空";
    private String C_电动机_电动机总扭矩Nm="空";
    private String C_电动机_电机布局="空";
    private String C_电动机_电机类型="空";
    private String C_电动机_后电动机最大功率kW="空";
    private String C_电动机_后电动机最大扭矩Nm="空";
    private String C_电动机_前电动机最大功率kW="空";
    private String C_电动机_前电动机最大扭矩Nm="空";
    private String C_电动机_驱动电机数="空";
    private String C_电动机_系统综合功率kW="空";
    private String C_电动机_系统综合马力Ps="空";
    private String C_电动机_系统综合扭矩Nm="空";
    private String C_发动机_发动机布局="空";
    private String C_发动机_发动机型号="空";
    private String C_发动机_缸盖材料="空";
    private String C_发动机_缸体材料="空";
    private String C_发动机_供油方式="空";
    private String C_发动机_环保标准="空";
    private String C_发动机_进气形式="空";
    private String C_发动机_每缸气门数个="空";
    private String C_发动机_排量L="空";
    private String C_发动机_排量mL="空";
    private String C_发动机_配气机构="空";
    private String C_发动机_气缸排列形式="空";
    private String C_发动机_气缸数个="空";
    private String C_发动机_燃油标号="空";
    private String C_发动机_压缩比="空";
    private String C_发动机_最大功率kW="空";
    private String C_发动机_最大功率转速rpm="空";
    private String C_发动机_最大净功率kW="空";
    private String C_发动机_最大马力Ps="空";
    private String C_发动机_最大扭矩Nm="空";
    private String C_发动机_最大扭矩转速rpm="空";
    private String C_辅助操控配置_倒车车侧预警系统="空";
    private String C_辅助操控配置_低速四驱="空";
    private String C_辅助操控配置_底盘透视="空";
    private String C_辅助操控配置_陡坡缓降="空";
    private String C_辅助操控配置_发动机启停="空";
    private String C_辅助操控配置_防侧翻系统="空";
    private String C_辅助操控配置_后驻车雷达="空";
    private String C_辅助操控配置_驾驶辅助影像="空";
    private String C_辅助操控配置_驾驶模式选择="空";
    private String C_辅助操控配置_开门碰撞预警="空";
    private String C_辅助操控配置_可变转向比="空";
    private String C_辅助操控配置_疲劳提醒="空";
    private String C_辅助操控配置_前驻车雷达="空";
    private String C_辅助操控配置_蠕行模式="空";
    private String C_辅助操控配置_上坡辅助="空";
    private String C_辅助操控配置_涉水感应系统="空";
    private String C_辅助操控配置_坦克转弯="空";
    private String C_辅助操控配置_巡航系统="空";
    private String C_辅助操控配置_遥控泊车="空";
    private String C_辅助操控配置_夜视系统="空";
    private String C_辅助操控配置_远程召唤="空";
    private String C_辅助操控配置_整体主动转向系统="空";
    private String C_辅助操控配置_自动泊车="空";
    private String C_辅助操控配置_自动驻车="空";
    private String C_辅助驾驶功能_并线辅助BSMBSD="空";
    private String C_辅助驾驶功能_车道保持LKAS="空";
    private String C_辅助驾驶功能_车道居中保持="空";
    private String C_辅助驾驶功能_车道偏离预警LDWS="空";
    private String C_辅助驾驶功能_城市辅助驾驶="空";
    private String C_辅助驾驶功能_倒车循迹="空";
    private String C_辅助驾驶功能_道路交通标识识别="空";
    private String C_辅助驾驶功能_高速辅助驾驶="空";
    private String C_辅助驾驶功能_后方碰撞预警="空";
    private String C_辅助驾驶功能_前方碰撞预警="空";
    private String C_辅助驾驶功能_匝道自动驶出入="空";
    private String C_辅助驾驶功能_主动刹车="空";
    private String C_辅助驾驶功能_自动变道辅助="空";
    private String C_辅助驾驶硬件_超声波雷达="空";
    private String C_辅助驾驶硬件_车内摄像头="空";
    private String C_辅助驾驶硬件_辅助驾驶系统="空";
    private String C_辅助驾驶硬件_辅助驾驶芯片="空";
    private String C_辅助驾驶硬件_毫米波雷达="空";
    private String C_辅助驾驶硬件_环境感知摄像头="空";
    private String C_辅助驾驶硬件_环境感知摄像头像素万="空";
    private String C_辅助驾驶硬件_环视摄像头="空";
    private String C_辅助驾驶硬件_环视摄像头像素万="空";
    private String C_辅助驾驶硬件_激光雷达10反射率探测距离m="空";
    private String C_辅助驾驶硬件_激光雷达点云数量万秒="空";
    private String C_辅助驾驶硬件_激光雷达品牌="空";
    private String C_辅助驾驶硬件_激光雷达数量="空";
    private String C_辅助驾驶硬件_激光雷达线数="空";
    private String C_辅助驾驶硬件_激光雷达型号="空";
    private String C_辅助驾驶硬件_激光雷达最远探测距离m="空";
    private String C_辅助驾驶硬件_驾驶辅助级别="空";
    private String C_辅助驾驶硬件_前方感知摄像头类型="空";
    private String C_辅助驾驶硬件_前方感知摄像头像素万="空";
    private String C_辅助驾驶硬件_芯片算力="空";
    private String C_基本信息_CLTC纯电续航km="空";
    private String C_基本信息_CLTC综合油耗L100km="空";
    private String C_基本信息_EPA纯电续航km="空";
    private String C_基本信息_NEDC纯电续航km="空";
    private String C_基本信息_NEDC综合油耗L100km="空";
    private String C_基本信息_WLTC纯电续航km="空";
    private String C_基本信息_WLTC综合油耗L100km="空";
    private String C_基本信息_变速箱="空";
    private String C_基本信息_厂商="空";
    private String C_基本信息_厂商指导价="空";
    private String C_基本信息_车款名称="空";
    private String C_基本信息_车身结构="空";
    private String C_基本信息_城市参考价="空";
    private String C_基本信息_电动机Ps="空";
    private String C_基本信息_发动机="空";
    private String C_基本信息_官方0100kmh加速s="空";
    private String C_基本信息_环保标准="空";
    private String C_基本信息_级别="空";
    private String C_基本信息_快充电量="空";
    private String C_基本信息_快充时间h="空";
    private String C_基本信息_亏电状态油耗L100km="空";
    private String C_基本信息_慢充电量="空";
    private String C_基本信息_慢充时间h="空";
    private String C_基本信息_内饰颜色="空";
    private String C_基本信息_能源类型="空";
    private String C_基本信息_上市时间="空";
    private String C_基本信息_首任车主质保政策="空";
    private String C_基本信息_外观颜色="空";
    private String C_基本信息_长宽高mm="空";
    private String C_基本信息_整车质保="空";
    private String C_基本信息_最大功率最大扭矩="空";
    private String C_基本信息_最高车速kmh="空";
    private String C_空调制冷_车内PM25过滤装置="空";
    private String C_空调制冷_车载冰箱="空";
    private String C_空调制冷_车载空气净化器="空";
    private String C_空调制冷_第二排空调="空";
    private String C_空调制冷_第三排空调="空";
    private String C_空调制冷_第一排空调="空";
    private String C_空调制冷_负离子发生器="空";
    private String C_空调制冷_空气质量监测="空";
    private String C_空调制冷_热泵空调="空";
    private String C_空调制冷_香氛系统="空";
    private String C_内部配置_ETC装置="空";
    private String C_内部配置_HUD抬头显示="空";
    private String C_内部配置_单踏板模式="空";
    private String C_内部配置_电动可调踏板="空";
    private String C_内部配置_多功能方向盘="空";
    private String C_内部配置_方向盘材质="空";
    private String C_内部配置_方向盘调节="空";
    private String C_内部配置_方向盘换挡="空";
    private String C_内部配置_方向盘加热="空";
    private String C_内部配置_换挡形式="空";
    private String C_内部配置_内置行车记录仪="空";
    private String C_内部配置_全液晶仪表盘="空";
    private String C_内部配置_手机无线充电="空";
    private String C_内部配置_手机无线最大充电功率W="空";
    private String C_内部配置_行车电脑显示屏="空";
    private String C_内部配置_仪表屏幕材质="空";
    private String C_内部配置_仪表屏幕尺寸英寸="空";
    private String C_内部配置_仪表屏幕分辨率px="空";
    private String C_内部配置_仪表屏幕像素密度PPI="空";
    private String C_内部配置_主动降噪="空";
    private String C_外部配置_侧滑门="空";
    private String C_外部配置_车侧脚踏板="空";
    private String C_外部配置_车顶行李架="空";
    private String C_外部配置_低速行车警示音="空";
    private String C_外部配置_电动扰流板="空";
    private String C_外部配置_电动尾门="空";
    private String C_外部配置_电吸门="空";
    private String C_外部配置_感应尾门="空";
    private String C_外部配置_光感天幕="空";
    private String C_外部配置_货箱宝="空";
    private String C_外部配置_轮圈材质="空";
    private String C_外部配置_哨兵千里眼模式="空";
    private String C_外部配置_天窗类型="空";
    private String C_外部配置_拖车钩="空";
    private String C_外部配置_拖车取电口="空";
    private String C_外部配置_尾门玻璃独立开启="空";
    private String C_外部配置_尾门位置记忆="空";
    private String C_外部配置_无框车门="空";
    private String C_外部配置_无钥匙进入="空";
    private String C_外部配置_无钥匙启动="空";
    private String C_外部配置_钥匙类型="空";
    private String C_外部配置_隐藏电动门把手="空";
    private String C_外部配置_运动外观套件="空";
    private String C_外部配置_整车无线充电="空";
    private String C_外部配置_主动闭合式进气格栅="空";
    private String C_外部配置_自动开合车门="空";
    private String C_影音娱乐_USBTypeC接口数量="空";
    private String C_影音娱乐_车内娱乐功能="空";
    private String C_影音娱乐_车载APP应用市场="空";
    private String C_影音娱乐_车载CDDVD="空";
    private String C_影音娱乐_多媒体充电接口="空";
    private String C_影音娱乐_分屏功能="空";
    private String C_影音娱乐_后排多媒体屏幕材质="空";
    private String C_影音娱乐_后排多媒体屏幕尺寸英寸="空";
    private String C_影音娱乐_后排多媒体屏幕分辨率px="空";
    private String C_影音娱乐_后排多媒体屏幕数量="空";
    private String C_影音娱乐_后排多媒体屏幕刷新率Hz="空";
    private String C_影音娱乐_后排多媒体屏幕像素密度PPI="空";
    private String C_影音娱乐_后排控制多媒体="空";
    private String C_影音娱乐_模拟声浪="空";
    private String C_影音娱乐_行李厢电源接口="空";
    private String C_影音娱乐_扬声器数量="空";
    private String C_影音娱乐_音响品牌="空";
    private String C_影音娱乐_座舱220V230V电源="空";
    private String C_主动安全_ABS防抱死="空";
    private String C_主动安全_安全带未系提醒="空";
    private String C_主动安全_车内生物监测="空";
    private String C_主动安全_车身稳定控制ESPDSCVSC等="空";
    private String C_主动安全_牵引力控制ASRTCSTRC等="空";
    private String C_主动安全_胎压监测="空";
    private String C_主动安全_制动辅助BAEBABAS等="空";
    private String C_主动安全_制动力分配EBDCBC等="空";
    private String C_座椅配置_第二排座椅电动调节="空";
    private String C_座椅配置_第二排座椅调节方式="空";
    private String C_座椅配置_第二排座椅功能="空";
    private String C_座椅配置_第三排座椅电动调节="空";
    private String C_座椅配置_第三排座椅调节方式="空";
    private String C_座椅配置_第三排座椅功能="空";
    private String C_座椅配置_第一排座椅功能="空";
    private String C_座椅配置_电动脚托="空";
    private String C_座椅配置_福祉座椅="空";
    private String C_座椅配置_副驾座椅电动调节="空";
    private String C_座椅配置_副驾座椅调节方式="空";
    private String C_座椅配置_后排杯架="空";
    private String C_座椅配置_后排折叠桌板="空";
    private String C_座椅配置_后排座椅电动放倒="空";
    private String C_座椅配置_后排座椅放倒方式="空";
    private String C_座椅配置_加热制冷杯架="空";
    private String C_座椅配置_老板键="空";
    private String C_座椅配置_零重力座椅功能="空";
    private String C_座椅配置_运动风格座椅="空";
    private String C_座椅配置_中央扶手="空";
    private String C_座椅配置_主驾座椅电动调节="空";
    private String C_座椅配置_主驾座椅调节方式="空";
    private String C_座椅配置_座椅布局="空";
    private String C_座椅配置_座椅材质="空";

    public int getC_ID() {
        return C_ID;
    }

    public void setC_ID(int c_ID) {
        C_ID = c_ID;
    }

    public String getC_version_id() {
        return C_version_id;
    }

    public void setC_version_id(String c_version_id) {
        this.C_version_id = c_version_id;
    }

    public String getC_被动安全_被动行人保护() {
        return C_被动安全_被动行人保护;
    }

    public void setC_被动安全_被动行人保护(String c_被动安全_被动行人保护) {
        C_被动安全_被动行人保护 = c_被动安全_被动行人保护;
    }

    public String getC_被动安全_侧安全气帘() {
        return C_被动安全_侧安全气帘;
    }

    public void setC_被动安全_侧安全气帘(String c_被动安全_侧安全气帘) {
        C_被动安全_侧安全气帘 = c_被动安全_侧安全气帘;
    }

    public String getC_被动安全_第二排侧气囊() {
        return C_被动安全_第二排侧气囊;
    }

    public void setC_被动安全_第二排侧气囊(String c_被动安全_第二排侧气囊) {
        C_被动安全_第二排侧气囊 = c_被动安全_第二排侧气囊;
    }

    public String getC_被动安全_第二排正向气囊() {
        return C_被动安全_第二排正向气囊;
    }

    public void setC_被动安全_第二排正向气囊(String c_被动安全_第二排正向气囊) {
        C_被动安全_第二排正向气囊 = c_被动安全_第二排正向气囊;
    }

    public String getC_被动安全_第一排侧气囊() {
        return C_被动安全_第一排侧气囊;
    }

    public void setC_被动安全_第一排侧气囊(String c_被动安全_第一排侧气囊) {
        C_被动安全_第一排侧气囊 = c_被动安全_第一排侧气囊;
    }

    public String getC_被动安全_儿童座椅接口() {
        return C_被动安全_儿童座椅接口;
    }

    public void setC_被动安全_儿童座椅接口(String c_被动安全_儿童座椅接口) {
        C_被动安全_儿童座椅接口 = c_被动安全_儿童座椅接口;
    }

    public String getC_被动安全_副驾驶安全气囊() {
        return C_被动安全_副驾驶安全气囊;
    }

    public void setC_被动安全_副驾驶安全气囊(String c_被动安全_副驾驶安全气囊) {
        C_被动安全_副驾驶安全气囊 = c_被动安全_副驾驶安全气囊;
    }

    public String getC_被动安全_副驾驶座垫式气囊() {
        return C_被动安全_副驾驶座垫式气囊;
    }

    public void setC_被动安全_副驾驶座垫式气囊(String c_被动安全_副驾驶座垫式气囊) {
        C_被动安全_副驾驶座垫式气囊 = c_被动安全_副驾驶座垫式气囊;
    }

    public String getC_被动安全_后排安全带式气囊() {
        return C_被动安全_后排安全带式气囊;
    }

    public void setC_被动安全_后排安全带式气囊(String c_被动安全_后排安全带式气囊) {
        C_被动安全_后排安全带式气囊 = c_被动安全_后排安全带式气囊;
    }

    public String getC_被动安全_后排座椅防下滑气囊() {
        return C_被动安全_后排座椅防下滑气囊;
    }

    public void setC_被动安全_后排座椅防下滑气囊(String c_被动安全_后排座椅防下滑气囊) {
        C_被动安全_后排座椅防下滑气囊 = c_被动安全_后排座椅防下滑气囊;
    }

    public String getC_被动安全_缺气保用轮胎() {
        return C_被动安全_缺气保用轮胎;
    }

    public void setC_被动安全_缺气保用轮胎(String c_被动安全_缺气保用轮胎) {
        C_被动安全_缺气保用轮胎 = c_被动安全_缺气保用轮胎;
    }

    public String getC_被动安全_膝部气囊() {
        return C_被动安全_膝部气囊;
    }

    public void setC_被动安全_膝部气囊(String c_被动安全_膝部气囊) {
        C_被动安全_膝部气囊 = c_被动安全_膝部气囊;
    }

    public String getC_被动安全_中央安全气囊() {
        return C_被动安全_中央安全气囊;
    }

    public void setC_被动安全_中央安全气囊(String c_被动安全_中央安全气囊) {
        C_被动安全_中央安全气囊 = c_被动安全_中央安全气囊;
    }

    public String getC_被动安全_主驾驶安全气囊() {
        return C_被动安全_主驾驶安全气囊;
    }

    public void setC_被动安全_主驾驶安全气囊(String c_被动安全_主驾驶安全气囊) {
        C_被动安全_主驾驶安全气囊 = c_被动安全_主驾驶安全气囊;
    }

    public String getC_变速箱_变速箱类型() {
        return C_变速箱_变速箱类型;
    }

    public void setC_变速箱_变速箱类型(String c_变速箱_变速箱类型) {
        C_变速箱_变速箱类型 = c_变速箱_变速箱类型;
    }

    public String getC_变速箱_变速箱描述() {
        return C_变速箱_变速箱描述;
    }

    public void setC_变速箱_变速箱描述(String c_变速箱_变速箱描述) {
        C_变速箱_变速箱描述 = c_变速箱_变速箱描述;
    }

    public String getC_变速箱_挡位数() {
        return C_变速箱_挡位数;
    }

    public void setC_变速箱_挡位数(String c_变速箱_挡位数) {
        C_变速箱_挡位数 = c_变速箱_挡位数;
    }

    public String getC_变速箱_卡车倒退挡位数() {
        return C_变速箱_卡车倒退挡位数;
    }

    public void setC_变速箱_卡车倒退挡位数(String c_变速箱_卡车倒退挡位数) {
        C_变速箱_卡车倒退挡位数 = c_变速箱_卡车倒退挡位数;
    }

    public String getC_变速箱_卡车前进挡位数() {
        return C_变速箱_卡车前进挡位数;
    }

    public void setC_变速箱_卡车前进挡位数(String c_变速箱_卡车前进挡位数) {
        C_变速箱_卡车前进挡位数 = c_变速箱_卡车前进挡位数;
    }

    public String getC_玻璃后视镜_车窗防夹手功能() {
        return C_玻璃后视镜_车窗防夹手功能;
    }

    public void setC_玻璃后视镜_车窗防夹手功能(String c_玻璃后视镜_车窗防夹手功能) {
        C_玻璃后视镜_车窗防夹手功能 = c_玻璃后视镜_车窗防夹手功能;
    }

    public String getC_玻璃后视镜_车窗一键升降() {
        return C_玻璃后视镜_车窗一键升降;
    }

    public void setC_玻璃后视镜_车窗一键升降(String c_玻璃后视镜_车窗一键升降) {
        C_玻璃后视镜_车窗一键升降 = c_玻璃后视镜_车窗一键升降;
    }

    public String getC_玻璃后视镜_车内化妆镜() {
        return C_玻璃后视镜_车内化妆镜;
    }

    public void setC_玻璃后视镜_车内化妆镜(String c_玻璃后视镜_车内化妆镜) {
        C_玻璃后视镜_车内化妆镜 = c_玻璃后视镜_车内化妆镜;
    }

    public String getC_玻璃后视镜_第二排电动车窗() {
        return C_玻璃后视镜_第二排电动车窗;
    }

    public void setC_玻璃后视镜_第二排电动车窗(String c_玻璃后视镜_第二排电动车窗) {
        C_玻璃后视镜_第二排电动车窗 = c_玻璃后视镜_第二排电动车窗;
    }

    public String getC_玻璃后视镜_第一排电动车窗() {
        return C_玻璃后视镜_第一排电动车窗;
    }

    public void setC_玻璃后视镜_第一排电动车窗(String c_玻璃后视镜_第一排电动车窗) {
        C_玻璃后视镜_第一排电动车窗 = c_玻璃后视镜_第一排电动车窗;
    }

    public String getC_玻璃后视镜_多层隔音玻璃() {
        return C_玻璃后视镜_多层隔音玻璃;
    }

    public void setC_玻璃后视镜_多层隔音玻璃(String c_玻璃后视镜_多层隔音玻璃) {
        C_玻璃后视镜_多层隔音玻璃 = c_玻璃后视镜_多层隔音玻璃;
    }

    public String getC_玻璃后视镜_感应雨刷功能() {
        return C_玻璃后视镜_感应雨刷功能;
    }

    public void setC_玻璃后视镜_感应雨刷功能(String c_玻璃后视镜_感应雨刷功能) {
        C_玻璃后视镜_感应雨刷功能 = c_玻璃后视镜_感应雨刷功能;
    }

    public String getC_玻璃后视镜_后风挡遮阳帘() {
        return C_玻璃后视镜_后风挡遮阳帘;
    }

    public void setC_玻璃后视镜_后风挡遮阳帘(String c_玻璃后视镜_后风挡遮阳帘) {
        C_玻璃后视镜_后风挡遮阳帘 = c_玻璃后视镜_后风挡遮阳帘;
    }

    public String getC_玻璃后视镜_后排侧隐私玻璃() {
        return C_玻璃后视镜_后排侧隐私玻璃;
    }

    public void setC_玻璃后视镜_后排侧隐私玻璃(String c_玻璃后视镜_后排侧隐私玻璃) {
        C_玻璃后视镜_后排侧隐私玻璃 = c_玻璃后视镜_后排侧隐私玻璃;
    }

    public String getC_玻璃后视镜_后排侧遮阳帘() {
        return C_玻璃后视镜_后排侧遮阳帘;
    }

    public void setC_玻璃后视镜_后排侧遮阳帘(String c_玻璃后视镜_后排侧遮阳帘) {
        C_玻璃后视镜_后排侧遮阳帘 = c_玻璃后视镜_后排侧遮阳帘;
    }

    public String getC_玻璃后视镜_后雨刷() {
        return C_玻璃后视镜_后雨刷;
    }

    public void setC_玻璃后视镜_后雨刷(String c_玻璃后视镜_后雨刷) {
        C_玻璃后视镜_后雨刷 = c_玻璃后视镜_后雨刷;
    }

    public String getC_玻璃后视镜_可加热喷水嘴() {
        return C_玻璃后视镜_可加热喷水嘴;
    }

    public void setC_玻璃后视镜_可加热喷水嘴(String c_玻璃后视镜_可加热喷水嘴) {
        C_玻璃后视镜_可加热喷水嘴 = c_玻璃后视镜_可加热喷水嘴;
    }

    public String getC_玻璃后视镜_流媒体外后视镜显示屏() {
        return C_玻璃后视镜_流媒体外后视镜显示屏;
    }

    public void setC_玻璃后视镜_流媒体外后视镜显示屏(String c_玻璃后视镜_流媒体外后视镜显示屏) {
        C_玻璃后视镜_流媒体外后视镜显示屏 = c_玻璃后视镜_流媒体外后视镜显示屏;
    }

    public String getC_玻璃后视镜_内后视镜功能() {
        return C_玻璃后视镜_内后视镜功能;
    }

    public void setC_玻璃后视镜_内后视镜功能(String c_玻璃后视镜_内后视镜功能) {
        C_玻璃后视镜_内后视镜功能 = c_玻璃后视镜_内后视镜功能;
    }

    public String getC_玻璃后视镜_外后视镜功能() {
        return C_玻璃后视镜_外后视镜功能;
    }

    public void setC_玻璃后视镜_外后视镜功能(String c_玻璃后视镜_外后视镜功能) {
        C_玻璃后视镜_外后视镜功能 = c_玻璃后视镜_外后视镜功能;
    }

    public String getC_车机互联_AR实景导航() {
        return C_车机互联_AR实景导航;
    }

    public void setC_车机互联_AR实景导航(String c_车机互联_AR实景导航) {
        C_车机互联_AR实景导航 = c_车机互联_AR实景导航;
    }

    public String getC_车机互联_OTA升级() {
        return C_车机互联_OTA升级;
    }

    public void setC_车机互联_OTA升级(String c_车机互联_OTA升级) {
        C_车机互联_OTA升级 = c_车机互联_OTA升级;
    }

    public String getC_车机互联_V2X通讯() {
        return C_车机互联_V2X通讯;
    }

    public void setC_车机互联_V2X通讯(String c_车机互联_V2X通讯) {
        C_车机互联_V2X通讯 = c_车机互联_V2X通讯;
    }

    public String getC_车机互联_车机WiFi功能() {
        return C_车机互联_车机WiFi功能;
    }

    public void setC_车机互联_车机WiFi功能(String c_车机互联_车机WiFi功能) {
        C_车机互联_车机WiFi功能 = c_车机互联_车机WiFi功能;
    }

    public String getC_车机互联_车机网络() {
        return C_车机互联_车机网络;
    }

    public void setC_车机互联_车机网络(String c_车机互联_车机网络) {
        C_车机互联_车机网络 = c_车机互联_车机网络;
    }

    public String getC_车机互联_车机系统() {
        return C_车机互联_车机系统;
    }

    public void setC_车机互联_车机系统(String c_车机互联_车机系统) {
        C_车机互联_车机系统 = c_车机互联_车机系统;
    }

    public String getC_车机互联_车机系统存储GB() {
        return C_车机互联_车机系统存储GB;
    }

    public void setC_车机互联_车机系统存储GB(String c_车机互联_车机系统存储GB) {
        C_车机互联_车机系统存储GB = c_车机互联_车机系统存储GB;
    }

    public String getC_车机互联_车机系统内存GB() {
        return C_车机互联_车机系统内存GB;
    }

    public void setC_车机互联_车机系统内存GB(String c_车机互联_车机系统内存GB) {
        C_车机互联_车机系统内存GB = c_车机互联_车机系统内存GB;
    }

    public String getC_车机互联_车机芯片() {
        return C_车机互联_车机芯片;
    }

    public void setC_车机互联_车机芯片(String c_车机互联_车机芯片) {
        C_车机互联_车机芯片 = c_车机互联_车机芯片;
    }

    public String getC_车机互联_车载导航地图() {
        return C_车机互联_车载导航地图;
    }

    public void setC_车机互联_车载导航地图(String c_车机互联_车载导航地图) {
        C_车机互联_车载导航地图 = c_车机互联_车载导航地图;
    }

    public String getC_车机互联_道路救援呼叫() {
        return C_车机互联_道路救援呼叫;
    }

    public void setC_车机互联_道路救援呼叫(String c_车机互联_道路救援呼叫) {
        C_车机互联_道路救援呼叫 = c_车机互联_道路救援呼叫;
    }

    public String getC_车机互联_多指飞屏操控() {
        return C_车机互联_多指飞屏操控;
    }

    public void setC_车机互联_多指飞屏操控(String c_车机互联_多指飞屏操控) {
        C_车机互联_多指飞屏操控 = c_车机互联_多指飞屏操控;
    }

    public String getC_车机互联_副驾屏幕() {
        return C_车机互联_副驾屏幕;
    }

    public void setC_车机互联_副驾屏幕(String c_车机互联_副驾屏幕) {
        C_车机互联_副驾屏幕 = c_车机互联_副驾屏幕;
    }

    public String getC_车机互联_副驾屏幕材质() {
        return C_车机互联_副驾屏幕材质;
    }

    public void setC_车机互联_副驾屏幕材质(String c_车机互联_副驾屏幕材质) {
        C_车机互联_副驾屏幕材质 = c_车机互联_副驾屏幕材质;
    }

    public String getC_车机互联_副驾屏幕尺寸英寸() {
        return C_车机互联_副驾屏幕尺寸英寸;
    }

    public void setC_车机互联_副驾屏幕尺寸英寸(String c_车机互联_副驾屏幕尺寸英寸) {
        C_车机互联_副驾屏幕尺寸英寸 = c_车机互联_副驾屏幕尺寸英寸;
    }

    public String getC_车机互联_副驾屏幕分辨率px() {
        return C_车机互联_副驾屏幕分辨率px;
    }

    public void setC_车机互联_副驾屏幕分辨率px(String c_车机互联_副驾屏幕分辨率px) {
        C_车机互联_副驾屏幕分辨率px = c_车机互联_副驾屏幕分辨率px;
    }

    public String getC_车机互联_副驾屏幕刷新率Hz() {
        return C_车机互联_副驾屏幕刷新率Hz;
    }

    public void setC_车机互联_副驾屏幕刷新率Hz(String c_车机互联_副驾屏幕刷新率Hz) {
        C_车机互联_副驾屏幕刷新率Hz = c_车机互联_副驾屏幕刷新率Hz;
    }

    public String getC_车机互联_副驾屏幕像素密度PPI() {
        return C_车机互联_副驾屏幕像素密度PPI;
    }

    public void setC_车机互联_副驾屏幕像素密度PPI(String c_车机互联_副驾屏幕像素密度PPI) {
        C_车机互联_副驾屏幕像素密度PPI = c_车机互联_副驾屏幕像素密度PPI;
    }

    public String getC_车机互联_高精地图() {
        return C_车机互联_高精地图;
    }

    public void setC_车机互联_高精地图(String c_车机互联_高精地图) {
        C_车机互联_高精地图 = c_车机互联_高精地图;
    }

    public String getC_车机互联_蓝牙车载电话() {
        return C_车机互联_蓝牙车载电话;
    }

    public void setC_车机互联_蓝牙车载电话(String c_车机互联_蓝牙车载电话) {
        C_车机互联_蓝牙车载电话 = c_车机互联_蓝牙车载电话;
    }

    public String getC_车机互联_面部识别() {
        return C_车机互联_面部识别;
    }

    public void setC_车机互联_面部识别(String c_车机互联_面部识别) {
        C_车机互联_面部识别 = c_车机互联_面部识别;
    }

    public String getC_车机互联_手机互联映射() {
        return C_车机互联_手机互联映射;
    }

    public void setC_车机互联_手机互联映射(String c_车机互联_手机互联映射) {
        C_车机互联_手机互联映射 = c_车机互联_手机互联映射;
    }

    public String getC_车机互联_手势控制() {
        return C_车机互联_手势控制;
    }

    public void setC_车机互联_手势控制(String c_车机互联_手势控制) {
        C_车机互联_手势控制 = c_车机互联_手势控制;
    }

    public String getC_车机互联_语音分区唤醒() {
        return C_车机互联_语音分区唤醒;
    }

    public void setC_车机互联_语音分区唤醒(String c_车机互联_语音分区唤醒) {
        C_车机互联_语音分区唤醒 = c_车机互联_语音分区唤醒;
    }

    public String getC_车机互联_语音连续识别() {
        return C_车机互联_语音连续识别;
    }

    public void setC_车机互联_语音连续识别(String c_车机互联_语音连续识别) {
        C_车机互联_语音连续识别 = c_车机互联_语音连续识别;
    }

    public String getC_车机互联_语音免唤醒() {
        return C_车机互联_语音免唤醒;
    }

    public void setC_车机互联_语音免唤醒(String c_车机互联_语音免唤醒) {
        C_车机互联_语音免唤醒 = c_车机互联_语音免唤醒;
    }

    public String getC_车机互联_语音识别控制功能() {
        return C_车机互联_语音识别控制功能;
    }

    public void setC_车机互联_语音识别控制功能(String c_车机互联_语音识别控制功能) {
        C_车机互联_语音识别控制功能 = c_车机互联_语音识别控制功能;
    }

    public String getC_车机互联_语音助手唤醒词() {
        return C_车机互联_语音助手唤醒词;
    }

    public void setC_车机互联_语音助手唤醒词(String c_车机互联_语音助手唤醒词) {
        C_车机互联_语音助手唤醒词 = c_车机互联_语音助手唤醒词;
    }

    public String getC_车机互联_远程控制功能() {
        return C_车机互联_远程控制功能;
    }

    public void setC_车机互联_远程控制功能(String c_车机互联_远程控制功能) {
        C_车机互联_远程控制功能 = c_车机互联_远程控制功能;
    }

    public String getC_车机互联_中控彩色屏幕() {
        return C_车机互联_中控彩色屏幕;
    }

    public void setC_车机互联_中控彩色屏幕(String c_车机互联_中控彩色屏幕) {
        C_车机互联_中控彩色屏幕 = c_车机互联_中控彩色屏幕;
    }

    public String getC_车机互联_中控屏幕材质() {
        return C_车机互联_中控屏幕材质;
    }

    public void setC_车机互联_中控屏幕材质(String c_车机互联_中控屏幕材质) {
        C_车机互联_中控屏幕材质 = c_车机互联_中控屏幕材质;
    }

    public String getC_车机互联_中控屏幕尺寸英寸() {
        return C_车机互联_中控屏幕尺寸英寸;
    }

    public void setC_车机互联_中控屏幕尺寸英寸(String c_车机互联_中控屏幕尺寸英寸) {
        C_车机互联_中控屏幕尺寸英寸 = c_车机互联_中控屏幕尺寸英寸;
    }

    public String getC_车机互联_中控屏幕分辨率px() {
        return C_车机互联_中控屏幕分辨率px;
    }

    public void setC_车机互联_中控屏幕分辨率px(String c_车机互联_中控屏幕分辨率px) {
        C_车机互联_中控屏幕分辨率px = c_车机互联_中控屏幕分辨率px;
    }

    public String getC_车机互联_中控屏幕亮度nit() {
        return C_车机互联_中控屏幕亮度nit;
    }

    public void setC_车机互联_中控屏幕亮度nit(String c_车机互联_中控屏幕亮度nit) {
        C_车机互联_中控屏幕亮度nit = c_车机互联_中控屏幕亮度nit;
    }

    public String getC_车机互联_中控屏幕色彩万色() {
        return C_车机互联_中控屏幕色彩万色;
    }

    public void setC_车机互联_中控屏幕色彩万色(String c_车机互联_中控屏幕色彩万色) {
        C_车机互联_中控屏幕色彩万色 = c_车机互联_中控屏幕色彩万色;
    }

    public String getC_车机互联_中控屏幕刷新率Hz() {
        return C_车机互联_中控屏幕刷新率Hz;
    }

    public void setC_车机互联_中控屏幕刷新率Hz(String c_车机互联_中控屏幕刷新率Hz) {
        C_车机互联_中控屏幕刷新率Hz = c_车机互联_中控屏幕刷新率Hz;
    }

    public String getC_车机互联_中控屏幕像素密度PPI() {
        return C_车机互联_中控屏幕像素密度PPI;
    }

    public void setC_车机互联_中控屏幕像素密度PPI(String c_车机互联_中控屏幕像素密度PPI) {
        C_车机互联_中控屏幕像素密度PPI = c_车机互联_中控屏幕像素密度PPI;
    }

    public String getC_车机互联_中控下屏幕材质() {
        return C_车机互联_中控下屏幕材质;
    }

    public void setC_车机互联_中控下屏幕材质(String c_车机互联_中控下屏幕材质) {
        C_车机互联_中控下屏幕材质 = c_车机互联_中控下屏幕材质;
    }

    public String getC_车机互联_中控下屏幕尺寸英寸() {
        return C_车机互联_中控下屏幕尺寸英寸;
    }

    public void setC_车机互联_中控下屏幕尺寸英寸(String c_车机互联_中控下屏幕尺寸英寸) {
        C_车机互联_中控下屏幕尺寸英寸 = c_车机互联_中控下屏幕尺寸英寸;
    }

    public String getC_车机互联_中控下屏幕分辨率px() {
        return C_车机互联_中控下屏幕分辨率px;
    }

    public void setC_车机互联_中控下屏幕分辨率px(String c_车机互联_中控下屏幕分辨率px) {
        C_车机互联_中控下屏幕分辨率px = c_车机互联_中控下屏幕分辨率px;
    }

    public String getC_车机互联_中控下屏幕像素密度PPI() {
        return C_车机互联_中控下屏幕像素密度PPI;
    }

    public void setC_车机互联_中控下屏幕像素密度PPI(String c_车机互联_中控下屏幕像素密度PPI) {
        C_车机互联_中控下屏幕像素密度PPI = c_车机互联_中控下屏幕像素密度PPI;
    }

    public String getC_车轮制动_备胎() {
        return C_车轮制动_备胎;
    }

    public void setC_车轮制动_备胎(String c_车轮制动_备胎) {
        C_车轮制动_备胎 = c_车轮制动_备胎;
    }

    public String getC_车轮制动_备胎放置方式() {
        return C_车轮制动_备胎放置方式;
    }

    public void setC_车轮制动_备胎放置方式(String c_车轮制动_备胎放置方式) {
        C_车轮制动_备胎放置方式 = c_车轮制动_备胎放置方式;
    }

    public String getC_车轮制动_后轮胎规格() {
        return C_车轮制动_后轮胎规格;
    }

    public void setC_车轮制动_后轮胎规格(String c_车轮制动_后轮胎规格) {
        C_车轮制动_后轮胎规格 = c_车轮制动_后轮胎规格;
    }

    public String getC_车轮制动_后制动器类型() {
        return C_车轮制动_后制动器类型;
    }

    public void setC_车轮制动_后制动器类型(String c_车轮制动_后制动器类型) {
        C_车轮制动_后制动器类型 = c_车轮制动_后制动器类型;
    }

    public String getC_车轮制动_轮胎规格() {
        return C_车轮制动_轮胎规格;
    }

    public void setC_车轮制动_轮胎规格(String c_车轮制动_轮胎规格) {
        C_车轮制动_轮胎规格 = c_车轮制动_轮胎规格;
    }

    public String getC_车轮制动_轮胎数() {
        return C_车轮制动_轮胎数;
    }

    public void setC_车轮制动_轮胎数(String c_车轮制动_轮胎数) {
        C_车轮制动_轮胎数 = c_车轮制动_轮胎数;
    }

    public String getC_车轮制动_前轮胎规格() {
        return C_车轮制动_前轮胎规格;
    }

    public void setC_车轮制动_前轮胎规格(String c_车轮制动_前轮胎规格) {
        C_车轮制动_前轮胎规格 = c_车轮制动_前轮胎规格;
    }

    public String getC_车轮制动_前制动器类型() {
        return C_车轮制动_前制动器类型;
    }

    public void setC_车轮制动_前制动器类型(String c_车轮制动_前制动器类型) {
        C_车轮制动_前制动器类型 = c_车轮制动_前制动器类型;
    }

    public String getC_车轮制动_驻车制动类型() {
        return C_车轮制动_驻车制动类型;
    }

    public void setC_车轮制动_驻车制动类型(String c_车轮制动_驻车制动类型) {
        C_车轮制动_驻车制动类型 = c_车轮制动_驻车制动类型;
    }

    public String getC_车身_车门开启方式() {
        return C_车身_车门开启方式;
    }

    public void setC_车身_车门开启方式(String c_车身_车门开启方式) {
        C_车身_车门开启方式 = c_车身_车门开启方式;
    }

    public String getC_车身_车门数() {
        return C_车身_车门数;
    }

    public void setC_车身_车门数(String c_车身_车门数) {
        C_车身_车门数 = c_车身_车门数;
    }

    public String getC_车身_车型种类() {
        return C_车身_车型种类;
    }

    public void setC_车身_车型种类(String c_车身_车型种类) {
        C_车身_车型种类 = c_车身_车型种类;
    }

    public String getC_车身_风阻系数Cd() {
        return C_车身_风阻系数Cd;
    }

    public void setC_车身_风阻系数Cd(String c_车身_风阻系数Cd) {
        C_车身_风阻系数Cd = c_车身_风阻系数Cd;
    }

    public String getC_车身_高度mm() {
        return C_车身_高度mm;
    }

    public void setC_车身_高度mm(String c_车身_高度mm) {
        C_车身_高度mm = c_车身_高度mm;
    }

    public String getC_车身_官方后备厢容积L() {
        return C_车身_官方后备厢容积L;
    }

    public void setC_车身_官方后备厢容积L(String c_车身_官方后备厢容积L) {
        C_车身_官方后备厢容积L = c_车身_官方后备厢容积L;
    }

    public String getC_车身_官方前备厢容积L() {
        return C_车身_官方前备厢容积L;
    }

    public void setC_车身_官方前备厢容积L(String c_车身_官方前备厢容积L) {
        C_车身_官方前备厢容积L = c_车身_官方前备厢容积L;
    }

    public String getC_车身_后轮距mm() {
        return C_车身_后轮距mm;
    }

    public void setC_车身_后轮距mm(String c_车身_后轮距mm) {
        C_车身_后轮距mm = c_车身_后轮距mm;
    }

    public String getC_车身_货箱高度mm() {
        return C_车身_货箱高度mm;
    }

    public void setC_车身_货箱高度mm(String c_车身_货箱高度mm) {
        C_车身_货箱高度mm = c_车身_货箱高度mm;
    }

    public String getC_车身_货箱宽度mm() {
        return C_车身_货箱宽度mm;
    }

    public void setC_车身_货箱宽度mm(String c_车身_货箱宽度mm) {
        C_车身_货箱宽度mm = c_车身_货箱宽度mm;
    }

    public String getC_车身_货箱长度mm() {
        return C_车身_货箱长度mm;
    }

    public void setC_车身_货箱长度mm(String c_车身_货箱长度mm) {
        C_车身_货箱长度mm = c_车身_货箱长度mm;
    }

    public String getC_车身_接近角() {
        return C_车身_接近角;
    }

    public void setC_车身_接近角(String c_车身_接近角) {
        C_车身_接近角 = c_车身_接近角;
    }

    public String getC_车身_空载最小离地间隙mm() {
        return C_车身_空载最小离地间隙mm;
    }

    public void setC_车身_空载最小离地间隙mm(String c_车身_空载最小离地间隙mm) {
        C_车身_空载最小离地间隙mm = c_车身_空载最小离地间隙mm;
    }

    public String getC_车身_宽度mm() {
        return C_车身_宽度mm;
    }

    public void setC_车身_宽度mm(String c_车身_宽度mm) {
        C_车身_宽度mm = c_车身_宽度mm;
    }

    public String getC_车身_离去角() {
        return C_车身_离去角;
    }

    public void setC_车身_离去角(String c_车身_离去角) {
        C_车身_离去角 = c_车身_离去角;
    }

    public String getC_车身_满载质量kg() {
        return C_车身_满载质量kg;
    }

    public void setC_车身_满载质量kg(String c_车身_满载质量kg) {
        C_车身_满载质量kg = c_车身_满载质量kg;
    }

    public String getC_车身_满载最小离地间隙mm() {
        return C_车身_满载最小离地间隙mm;
    }

    public void setC_车身_满载最小离地间隙mm(String c_车身_满载最小离地间隙mm) {
        C_车身_满载最小离地间隙mm = c_车身_满载最小离地间隙mm;
    }

    public String getC_车身_气罐容积L() {
        return C_车身_气罐容积L;
    }

    public void setC_车身_气罐容积L(String c_车身_气罐容积L) {
        C_车身_气罐容积L = c_车身_气罐容积L;
    }

    public String getC_车身_牵引质量kg() {
        return C_车身_牵引质量kg;
    }

    public void setC_车身_牵引质量kg(String c_车身_牵引质量kg) {
        C_车身_牵引质量kg = c_车身_牵引质量kg;
    }

    public String getC_车身_前轮距mm() {
        return C_车身_前轮距mm;
    }

    public void setC_车身_前轮距mm(String c_车身_前轮距mm) {
        C_车身_前轮距mm = c_车身_前轮距mm;
    }

    public String getC_车身_实测后备厢容积L() {
        return C_车身_实测后备厢容积L;
    }

    public void setC_车身_实测后备厢容积L(String c_车身_实测后备厢容积L) {
        C_车身_实测后备厢容积L = c_车身_实测后备厢容积L;
    }

    public String getC_车身_实测前备厢容积L() {
        return C_车身_实测前备厢容积L;
    }

    public void setC_车身_实测前备厢容积L(String c_车身_实测前备厢容积L) {
        C_车身_实测前备厢容积L = c_车身_实测前备厢容积L;
    }

    public String getC_车身_通过角() {
        return C_车身_通过角;
    }

    public void setC_车身_通过角(String c_车身_通过角) {
        C_车身_通过角 = c_车身_通过角;
    }

    public String getC_车身_油箱容积L() {
        return C_车身_油箱容积L;
    }

    public void setC_车身_油箱容积L(String c_车身_油箱容积L) {
        C_车身_油箱容积L = c_车身_油箱容积L;
    }

    public String getC_车身_载重质量kg() {
        return C_车身_载重质量kg;
    }

    public void setC_车身_载重质量kg(String c_车身_载重质量kg) {
        C_车身_载重质量kg = c_车身_载重质量kg;
    }

    public String getC_车身_长度mm() {
        return C_车身_长度mm;
    }

    public void setC_车身_长度mm(String c_车身_长度mm) {
        C_车身_长度mm = c_车身_长度mm;
    }

    public String getC_车身_整备质量kg() {
        return C_车身_整备质量kg;
    }

    public void setC_车身_整备质量kg(String c_车身_整备质量kg) {
        C_车身_整备质量kg = c_车身_整备质量kg;
    }

    public String getC_车身_轴距mm() {
        return C_车身_轴距mm;
    }

    public void setC_车身_轴距mm(String c_车身_轴距mm) {
        C_车身_轴距mm = c_车身_轴距mm;
    }

    public String getC_车身_最大爬坡度() {
        return C_车身_最大爬坡度;
    }

    public void setC_车身_最大爬坡度(String c_车身_最大爬坡度) {
        C_车身_最大爬坡度 = c_车身_最大爬坡度;
    }

    public String getC_车身_最小转弯半径m() {
        return C_车身_最小转弯半径m;
    }

    public void setC_车身_最小转弯半径m(String c_车身_最小转弯半径m) {
        C_车身_最小转弯半径m = c_车身_最小转弯半径m;
    }

    public String getC_车身_座位数() {
        return C_车身_座位数;
    }

    public void setC_车身_座位数(String c_车身_座位数) {
        C_车身_座位数 = c_车身_座位数;
    }

    public String getC_灯光功能_LED日间行车灯() {
        return C_灯光功能_LED日间行车灯;
    }

    public void setC_灯光功能_LED日间行车灯(String c_灯光功能_LED日间行车灯) {
        C_灯光功能_LED日间行车灯 = c_灯光功能_LED日间行车灯;
    }

    public String getC_灯光功能_车内氛围灯() {
        return C_灯光功能_车内氛围灯;
    }

    public void setC_灯光功能_车内氛围灯(String c_灯光功能_车内氛围灯) {
        C_灯光功能_车内氛围灯 = c_灯光功能_车内氛围灯;
    }

    public String getC_灯光功能_大灯功能() {
        return C_灯光功能_大灯功能;
    }

    public void setC_灯光功能_大灯功能(String c_灯光功能_大灯功能) {
        C_灯光功能_大灯功能 = c_灯光功能_大灯功能;
    }

    public String getC_灯光功能_大灯清洗装置() {
        return C_灯光功能_大灯清洗装置;
    }

    public void setC_灯光功能_大灯清洗装置(String c_灯光功能_大灯清洗装置) {
        C_灯光功能_大灯清洗装置 = c_灯光功能_大灯清洗装置;
    }

    public String getC_灯光功能_灯光特色功能() {
        return C_灯光功能_灯光特色功能;
    }

    public void setC_灯光功能_灯光特色功能(String c_灯光功能_灯光特色功能) {
        C_灯光功能_灯光特色功能 = c_灯光功能_灯光特色功能;
    }

    public String getC_灯光功能_近光灯光源() {
        return C_灯光功能_近光灯光源;
    }

    public void setC_灯光功能_近光灯光源(String c_灯光功能_近光灯光源) {
        C_灯光功能_近光灯光源 = c_灯光功能_近光灯光源;
    }

    public String getC_灯光功能_前雾灯() {
        return C_灯光功能_前雾灯;
    }

    public void setC_灯光功能_前雾灯(String c_灯光功能_前雾灯) {
        C_灯光功能_前雾灯 = c_灯光功能_前雾灯;
    }

    public String getC_灯光功能_远光灯光源() {
        return C_灯光功能_远光灯光源;
    }

    public void setC_灯光功能_远光灯光源(String c_灯光功能_远光灯光源) {
        C_灯光功能_远光灯光源 = c_灯光功能_远光灯光源;
    }

    public String getC_灯光功能_主动式环境氛围灯() {
        return C_灯光功能_主动式环境氛围灯;
    }

    public void setC_灯光功能_主动式环境氛围灯(String c_灯光功能_主动式环境氛围灯) {
        C_灯光功能_主动式环境氛围灯 = c_灯光功能_主动式环境氛围灯;
    }

    public String getC_灯光功能_转向辅助灯() {
        return C_灯光功能_转向辅助灯;
    }

    public void setC_灯光功能_转向辅助灯(String c_灯光功能_转向辅助灯) {
        C_灯光功能_转向辅助灯 = c_灯光功能_转向辅助灯;
    }

    public String getC_底盘转向_差速锁() {
        return C_底盘转向_差速锁;
    }

    public void setC_底盘转向_差速锁(String c_底盘转向_差速锁) {
        C_底盘转向_差速锁 = c_底盘转向_差速锁;
    }

    public String getC_底盘转向_车体结构() {
        return C_底盘转向_车体结构;
    }

    public void setC_底盘转向_车体结构(String c_底盘转向_车体结构) {
        C_底盘转向_车体结构 = c_底盘转向_车体结构;
    }

    public String getC_底盘转向_后桥描述() {
        return C_底盘转向_后桥描述;
    }

    public void setC_底盘转向_后桥描述(String c_底盘转向_后桥描述) {
        C_底盘转向_后桥描述 = c_底盘转向_后桥描述;
    }

    public String getC_底盘转向_后桥速比() {
        return C_底盘转向_后桥速比;
    }

    public void setC_底盘转向_后桥速比(String c_底盘转向_后桥速比) {
        C_底盘转向_后桥速比 = c_底盘转向_后桥速比;
    }

    public String getC_底盘转向_后桥允许载荷kg() {
        return C_底盘转向_后桥允许载荷kg;
    }

    public void setC_底盘转向_后桥允许载荷kg(String c_底盘转向_后桥允许载荷kg) {
        C_底盘转向_后桥允许载荷kg = c_底盘转向_后桥允许载荷kg;
    }

    public String getC_底盘转向_后悬架类型() {
        return C_底盘转向_后悬架类型;
    }

    public void setC_底盘转向_后悬架类型(String c_底盘转向_后悬架类型) {
        C_底盘转向_后悬架类型 = c_底盘转向_后悬架类型;
    }

    public String getC_底盘转向_缓速器类型() {
        return C_底盘转向_缓速器类型;
    }

    public void setC_底盘转向_缓速器类型(String c_底盘转向_缓速器类型) {
        C_底盘转向_缓速器类型 = c_底盘转向_缓速器类型;
    }

    public String getC_底盘转向_卡车驱动形式() {
        return C_底盘转向_卡车驱动形式;
    }

    public void setC_底盘转向_卡车驱动形式(String c_底盘转向_卡车驱动形式) {
        C_底盘转向_卡车驱动形式 = c_底盘转向_卡车驱动形式;
    }

    public String getC_底盘转向_可调悬架功能() {
        return C_底盘转向_可调悬架功能;
    }

    public void setC_底盘转向_可调悬架功能(String c_底盘转向_可调悬架功能) {
        C_底盘转向_可调悬架功能 = c_底盘转向_可调悬架功能;
    }

    public String getC_底盘转向_可调悬架种类() {
        return C_底盘转向_可调悬架种类;
    }

    public void setC_底盘转向_可调悬架种类(String c_底盘转向_可调悬架种类) {
        C_底盘转向_可调悬架种类 = c_底盘转向_可调悬架种类;
    }

    public String getC_底盘转向_客车后悬架类型() {
        return C_底盘转向_客车后悬架类型;
    }

    public void setC_底盘转向_客车后悬架类型(String c_底盘转向_客车后悬架类型) {
        C_底盘转向_客车后悬架类型 = c_底盘转向_客车后悬架类型;
    }

    public String getC_底盘转向_客车前悬架类型() {
        return C_底盘转向_客车前悬架类型;
    }

    public void setC_底盘转向_客车前悬架类型(String c_底盘转向_客车前悬架类型) {
        C_底盘转向_客车前悬架类型 = c_底盘转向_客车前悬架类型;
    }

    public String getC_底盘转向_前桥描述() {
        return C_底盘转向_前桥描述;
    }

    public void setC_底盘转向_前桥描述(String c_底盘转向_前桥描述) {
        C_底盘转向_前桥描述 = c_底盘转向_前桥描述;
    }

    public String getC_底盘转向_前桥允许载荷kg() {
        return C_底盘转向_前桥允许载荷kg;
    }

    public void setC_底盘转向_前桥允许载荷kg(String c_底盘转向_前桥允许载荷kg) {
        C_底盘转向_前桥允许载荷kg = c_底盘转向_前桥允许载荷kg;
    }

    public String getC_底盘转向_前悬架类型() {
        return C_底盘转向_前悬架类型;
    }

    public void setC_底盘转向_前悬架类型(String c_底盘转向_前悬架类型) {
        C_底盘转向_前悬架类型 = c_底盘转向_前悬架类型;
    }

    public String getC_底盘转向_驱动形式() {
        return C_底盘转向_驱动形式;
    }

    public void setC_底盘转向_驱动形式(String c_底盘转向_驱动形式) {
        C_底盘转向_驱动形式 = c_底盘转向_驱动形式;
    }

    public String getC_底盘转向_四驱形式() {
        return C_底盘转向_四驱形式;
    }

    public void setC_底盘转向_四驱形式(String c_底盘转向_四驱形式) {
        C_底盘转向_四驱形式 = c_底盘转向_四驱形式;
    }

    public String getC_底盘转向_限滑差速器() {
        return C_底盘转向_限滑差速器;
    }

    public void setC_底盘转向_限滑差速器(String c_底盘转向_限滑差速器) {
        C_底盘转向_限滑差速器 = c_底盘转向_限滑差速器;
    }

    public String getC_底盘转向_中央差速器结构() {
        return C_底盘转向_中央差速器结构;
    }

    public void setC_底盘转向_中央差速器结构(String c_底盘转向_中央差速器结构) {
        C_底盘转向_中央差速器结构 = c_底盘转向_中央差速器结构;
    }

    public String getC_底盘转向_助力类型() {
        return C_底盘转向_助力类型;
    }

    public void setC_底盘转向_助力类型(String c_底盘转向_助力类型) {
        C_底盘转向_助力类型 = c_底盘转向_助力类型;
    }

    public String getC_底盘转向_最大涉水深度mm() {
        return C_底盘转向_最大涉水深度mm;
    }

    public void setC_底盘转向_最大涉水深度mm(String c_底盘转向_最大涉水深度mm) {
        C_底盘转向_最大涉水深度mm = c_底盘转向_最大涉水深度mm;
    }

    public String getC_电池补能_CLTC纯电续航km() {
        return C_电池补能_CLTC纯电续航km;
    }

    public void setC_电池补能_CLTC纯电续航km(String c_电池补能_CLTC纯电续航km) {
        C_电池补能_CLTC纯电续航km = c_电池补能_CLTC纯电续航km;
    }

    public String getC_电池补能_CLTC综合续航km() {
        return C_电池补能_CLTC综合续航km;
    }

    public void setC_电池补能_CLTC综合续航km(String c_电池补能_CLTC综合续航km) {
        C_电池补能_CLTC综合续航km = c_电池补能_CLTC综合续航km;
    }

    public String getC_电池补能_EPA纯电续航km() {
        return C_电池补能_EPA纯电续航km;
    }

    public void setC_电池补能_EPA纯电续航km(String c_电池补能_EPA纯电续航km) {
        C_电池补能_EPA纯电续航km = c_电池补能_EPA纯电续航km;
    }

    public String getC_电池补能_NEDC纯电续航km() {
        return C_电池补能_NEDC纯电续航km;
    }

    public void setC_电池补能_NEDC纯电续航km(String c_电池补能_NEDC纯电续航km) {
        C_电池补能_NEDC纯电续航km = c_电池补能_NEDC纯电续航km;
    }

    public String getC_电池补能_NEDC综合续航km() {
        return C_电池补能_NEDC综合续航km;
    }

    public void setC_电池补能_NEDC综合续航km(String c_电池补能_NEDC综合续航km) {
        C_电池补能_NEDC综合续航km = c_电池补能_NEDC综合续航km;
    }

    public String getC_电池补能_WLTC纯电续航km() {
        return C_电池补能_WLTC纯电续航km;
    }

    public void setC_电池补能_WLTC纯电续航km(String c_电池补能_WLTC纯电续航km) {
        C_电池补能_WLTC纯电续航km = c_电池补能_WLTC纯电续航km;
    }

    public String getC_电池补能_WLTC综合续航km() {
        return C_电池补能_WLTC综合续航km;
    }

    public void setC_电池补能_WLTC综合续航km(String c_电池补能_WLTC综合续航km) {
        C_电池补能_WLTC综合续航km = c_电池补能_WLTC综合续航km;
    }

    public String getC_电池补能_百公里耗电量kWh100km() {
        return C_电池补能_百公里耗电量kWh100km;
    }

    public void setC_电池补能_百公里耗电量kWh100km(String c_电池补能_百公里耗电量kWh100km) {
        C_电池补能_百公里耗电量kWh100km = c_电池补能_百公里耗电量kWh100km;
    }

    public String getC_电池补能_车辆充电口() {
        return C_电池补能_车辆充电口;
    }

    public void setC_电池补能_车辆充电口(String c_电池补能_车辆充电口) {
        C_电池补能_车辆充电口 = c_电池补能_车辆充电口;
    }

    public String getC_电池补能_车辆换电() {
        return C_电池补能_车辆换电;
    }

    public void setC_电池补能_车辆换电(String c_电池补能_车辆换电) {
        C_电池补能_车辆换电 = c_电池补能_车辆换电;
    }

    public String getC_电池补能_电池电量kWh() {
        return C_电池补能_电池电量kWh;
    }

    public void setC_电池补能_电池电量kWh(String c_电池补能_电池电量kWh) {
        C_电池补能_电池电量kWh = c_电池补能_电池电量kWh;
    }

    public String getC_电池补能_电池类型() {
        return C_电池补能_电池类型;
    }

    public void setC_电池补能_电池类型(String c_电池补能_电池类型) {
        C_电池补能_电池类型 = c_电池补能_电池类型;
    }

    public String getC_电池补能_电池能量密度Whkg() {
        return C_电池补能_电池能量密度Whkg;
    }

    public void setC_电池补能_电池能量密度Whkg(String c_电池补能_电池能量密度Whkg) {
        C_电池补能_电池能量密度Whkg = c_电池补能_电池能量密度Whkg;
    }

    public String getC_电池补能_电池温度管理() {
        return C_电池补能_电池温度管理;
    }

    public void setC_电池补能_电池温度管理(String c_电池补能_电池温度管理) {
        C_电池补能_电池温度管理 = c_电池补能_电池温度管理;
    }

    public String getC_电池补能_电池组质保() {
        return C_电池补能_电池组质保;
    }

    public void setC_电池补能_电池组质保(String c_电池补能_电池组质保) {
        C_电池补能_电池组质保 = c_电池补能_电池组质保;
    }

    public String getC_电池补能_电芯品牌() {
        return C_电池补能_电芯品牌;
    }

    public void setC_电池补能_电芯品牌(String c_电池补能_电芯品牌) {
        C_电池补能_电芯品牌 = c_电池补能_电芯品牌;
    }

    public String getC_电池补能_对外放电功率() {
        return C_电池补能_对外放电功率;
    }

    public void setC_电池补能_对外放电功率(String c_电池补能_对外放电功率) {
        C_电池补能_对外放电功率 = c_电池补能_对外放电功率;
    }

    public String getC_电池补能_对外放电功能() {
        return C_电池补能_对外放电功能;
    }

    public void setC_电池补能_对外放电功能(String c_电池补能_对外放电功能) {
        C_电池补能_对外放电功能 = c_电池补能_对外放电功能;
    }

    public String getC_电池补能_高压快充平台() {
        return C_电池补能_高压快充平台;
    }

    public void setC_电池补能_高压快充平台(String c_电池补能_高压快充平台) {
        C_电池补能_高压快充平台 = c_电池补能_高压快充平台;
    }

    public String getC_电池补能_换电时间min() {
        return C_电池补能_换电时间min;
    }

    public void setC_电池补能_换电时间min(String c_电池补能_换电时间min) {
        C_电池补能_换电时间min = c_电池补能_换电时间min;
    }

    public String getC_电池补能_家用充电桩() {
        return C_电池补能_家用充电桩;
    }

    public void setC_电池补能_家用充电桩(String c_电池补能_家用充电桩) {
        C_电池补能_家用充电桩 = c_电池补能_家用充电桩;
    }

    public String getC_电池补能_快充电量() {
        return C_电池补能_快充电量;
    }

    public void setC_电池补能_快充电量(String c_电池补能_快充电量) {
        C_电池补能_快充电量 = c_电池补能_快充电量;
    }

    public String getC_电池补能_快充功率kW() {
        return C_电池补能_快充功率kW;
    }

    public void setC_电池补能_快充功率kW(String c_电池补能_快充功率kW) {
        C_电池补能_快充功率kW = c_电池补能_快充功率kW;
    }

    public String getC_电池补能_快充口位置() {
        return C_电池补能_快充口位置;
    }

    public void setC_电池补能_快充口位置(String c_电池补能_快充口位置) {
        C_电池补能_快充口位置 = c_电池补能_快充口位置;
    }

    public String getC_电池补能_快充时间h() {
        return C_电池补能_快充时间h;
    }

    public void setC_电池补能_快充时间h(String c_电池补能_快充时间h) {
        C_电池补能_快充时间h = c_电池补能_快充时间h;
    }

    public String getC_电池补能_快充时间min() {
        return C_电池补能_快充时间min;
    }

    public void setC_电池补能_快充时间min(String c_电池补能_快充时间min) {
        C_电池补能_快充时间min = c_电池补能_快充时间min;
    }

    public String getC_电池补能_慢充电量() {
        return C_电池补能_慢充电量;
    }

    public void setC_电池补能_慢充电量(String c_电池补能_慢充电量) {
        C_电池补能_慢充电量 = c_电池补能_慢充电量;
    }

    public String getC_电池补能_慢充功率kW() {
        return C_电池补能_慢充功率kW;
    }

    public void setC_电池补能_慢充功率kW(String c_电池补能_慢充功率kW) {
        C_电池补能_慢充功率kW = c_电池补能_慢充功率kW;
    }

    public String getC_电池补能_慢充口位置() {
        return C_电池补能_慢充口位置;
    }

    public void setC_电池补能_慢充口位置(String c_电池补能_慢充口位置) {
        C_电池补能_慢充口位置 = c_电池补能_慢充口位置;
    }

    public String getC_电池补能_慢充时间h() {
        return C_电池补能_慢充时间h;
    }

    public void setC_电池补能_慢充时间h(String c_电池补能_慢充时间h) {
        C_电池补能_慢充时间h = c_电池补能_慢充时间h;
    }

    public String getC_电池补能_首任车主电池组质保() {
        return C_电池补能_首任车主电池组质保;
    }

    public void setC_电池补能_首任车主电池组质保(String c_电池补能_首任车主电池组质保) {
        C_电池补能_首任车主电池组质保 = c_电池补能_首任车主电池组质保;
    }

    public String getC_电池补能_随车充电枪() {
        return C_电池补能_随车充电枪;
    }

    public void setC_电池补能_随车充电枪(String c_电池补能_随车充电枪) {
        C_电池补能_随车充电枪 = c_电池补能_随车充电枪;
    }

    public String getC_电动机_电动机品牌() {
        return C_电动机_电动机品牌;
    }

    public void setC_电动机_电动机品牌(String c_电动机_电动机品牌) {
        C_电动机_电动机品牌 = c_电动机_电动机品牌;
    }

    public String getC_电动机_电动机型号() {
        return C_电动机_电动机型号;
    }

    public void setC_电动机_电动机型号(String c_电动机_电动机型号) {
        C_电动机_电动机型号 = c_电动机_电动机型号;
    }

    public String getC_电动机_电动机总功率kW() {
        return C_电动机_电动机总功率kW;
    }

    public void setC_电动机_电动机总功率kW(String c_电动机_电动机总功率kW) {
        C_电动机_电动机总功率kW = c_电动机_电动机总功率kW;
    }

    public String getC_电动机_电动机总马力Ps() {
        return C_电动机_电动机总马力Ps;
    }

    public void setC_电动机_电动机总马力Ps(String c_电动机_电动机总马力Ps) {
        C_电动机_电动机总马力Ps = c_电动机_电动机总马力Ps;
    }

    public String getC_电动机_电动机总扭矩Nm() {
        return C_电动机_电动机总扭矩Nm;
    }

    public void setC_电动机_电动机总扭矩Nm(String c_电动机_电动机总扭矩Nm) {
        C_电动机_电动机总扭矩Nm = c_电动机_电动机总扭矩Nm;
    }

    public String getC_电动机_电机布局() {
        return C_电动机_电机布局;
    }

    public void setC_电动机_电机布局(String c_电动机_电机布局) {
        C_电动机_电机布局 = c_电动机_电机布局;
    }

    public String getC_电动机_电机类型() {
        return C_电动机_电机类型;
    }

    public void setC_电动机_电机类型(String c_电动机_电机类型) {
        C_电动机_电机类型 = c_电动机_电机类型;
    }

    public String getC_电动机_后电动机最大功率kW() {
        return C_电动机_后电动机最大功率kW;
    }

    public void setC_电动机_后电动机最大功率kW(String c_电动机_后电动机最大功率kW) {
        C_电动机_后电动机最大功率kW = c_电动机_后电动机最大功率kW;
    }

    public String getC_电动机_后电动机最大扭矩Nm() {
        return C_电动机_后电动机最大扭矩Nm;
    }

    public void setC_电动机_后电动机最大扭矩Nm(String c_电动机_后电动机最大扭矩Nm) {
        C_电动机_后电动机最大扭矩Nm = c_电动机_后电动机最大扭矩Nm;
    }

    public String getC_电动机_前电动机最大功率kW() {
        return C_电动机_前电动机最大功率kW;
    }

    public void setC_电动机_前电动机最大功率kW(String c_电动机_前电动机最大功率kW) {
        C_电动机_前电动机最大功率kW = c_电动机_前电动机最大功率kW;
    }

    public String getC_电动机_前电动机最大扭矩Nm() {
        return C_电动机_前电动机最大扭矩Nm;
    }

    public void setC_电动机_前电动机最大扭矩Nm(String c_电动机_前电动机最大扭矩Nm) {
        C_电动机_前电动机最大扭矩Nm = c_电动机_前电动机最大扭矩Nm;
    }

    public String getC_电动机_驱动电机数() {
        return C_电动机_驱动电机数;
    }

    public void setC_电动机_驱动电机数(String c_电动机_驱动电机数) {
        C_电动机_驱动电机数 = c_电动机_驱动电机数;
    }

    public String getC_电动机_系统综合功率kW() {
        return C_电动机_系统综合功率kW;
    }

    public void setC_电动机_系统综合功率kW(String c_电动机_系统综合功率kW) {
        C_电动机_系统综合功率kW = c_电动机_系统综合功率kW;
    }

    public String getC_电动机_系统综合马力Ps() {
        return C_电动机_系统综合马力Ps;
    }

    public void setC_电动机_系统综合马力Ps(String c_电动机_系统综合马力Ps) {
        C_电动机_系统综合马力Ps = c_电动机_系统综合马力Ps;
    }

    public String getC_电动机_系统综合扭矩Nm() {
        return C_电动机_系统综合扭矩Nm;
    }

    public void setC_电动机_系统综合扭矩Nm(String c_电动机_系统综合扭矩Nm) {
        C_电动机_系统综合扭矩Nm = c_电动机_系统综合扭矩Nm;
    }

    public String getC_发动机_发动机布局() {
        return C_发动机_发动机布局;
    }

    public void setC_发动机_发动机布局(String c_发动机_发动机布局) {
        C_发动机_发动机布局 = c_发动机_发动机布局;
    }

    public String getC_发动机_发动机型号() {
        return C_发动机_发动机型号;
    }

    public void setC_发动机_发动机型号(String c_发动机_发动机型号) {
        C_发动机_发动机型号 = c_发动机_发动机型号;
    }

    public String getC_发动机_缸盖材料() {
        return C_发动机_缸盖材料;
    }

    public void setC_发动机_缸盖材料(String c_发动机_缸盖材料) {
        C_发动机_缸盖材料 = c_发动机_缸盖材料;
    }

    public String getC_发动机_缸体材料() {
        return C_发动机_缸体材料;
    }

    public void setC_发动机_缸体材料(String c_发动机_缸体材料) {
        C_发动机_缸体材料 = c_发动机_缸体材料;
    }

    public String getC_发动机_供油方式() {
        return C_发动机_供油方式;
    }

    public void setC_发动机_供油方式(String c_发动机_供油方式) {
        C_发动机_供油方式 = c_发动机_供油方式;
    }

    public String getC_发动机_环保标准() {
        return C_发动机_环保标准;
    }

    public void setC_发动机_环保标准(String c_发动机_环保标准) {
        C_发动机_环保标准 = c_发动机_环保标准;
    }

    public String getC_发动机_进气形式() {
        return C_发动机_进气形式;
    }

    public void setC_发动机_进气形式(String c_发动机_进气形式) {
        C_发动机_进气形式 = c_发动机_进气形式;
    }

    public String getC_发动机_每缸气门数个() {
        return C_发动机_每缸气门数个;
    }

    public void setC_发动机_每缸气门数个(String c_发动机_每缸气门数个) {
        C_发动机_每缸气门数个 = c_发动机_每缸气门数个;
    }

    public String getC_发动机_排量L() {
        return C_发动机_排量L;
    }

    public void setC_发动机_排量L(String c_发动机_排量L) {
        C_发动机_排量L = c_发动机_排量L;
    }

    public String getC_发动机_排量mL() {
        return C_发动机_排量mL;
    }

    public void setC_发动机_排量mL(String c_发动机_排量mL) {
        C_发动机_排量mL = c_发动机_排量mL;
    }

    public String getC_发动机_配气机构() {
        return C_发动机_配气机构;
    }

    public void setC_发动机_配气机构(String c_发动机_配气机构) {
        C_发动机_配气机构 = c_发动机_配气机构;
    }

    public String getC_发动机_气缸排列形式() {
        return C_发动机_气缸排列形式;
    }

    public void setC_发动机_气缸排列形式(String c_发动机_气缸排列形式) {
        C_发动机_气缸排列形式 = c_发动机_气缸排列形式;
    }

    public String getC_发动机_气缸数个() {
        return C_发动机_气缸数个;
    }

    public void setC_发动机_气缸数个(String c_发动机_气缸数个) {
        C_发动机_气缸数个 = c_发动机_气缸数个;
    }

    public String getC_发动机_燃油标号() {
        return C_发动机_燃油标号;
    }

    public void setC_发动机_燃油标号(String c_发动机_燃油标号) {
        C_发动机_燃油标号 = c_发动机_燃油标号;
    }

    public String getC_发动机_压缩比() {
        return C_发动机_压缩比;
    }

    public void setC_发动机_压缩比(String c_发动机_压缩比) {
        C_发动机_压缩比 = c_发动机_压缩比;
    }

    public String getC_发动机_最大功率kW() {
        return C_发动机_最大功率kW;
    }

    public void setC_发动机_最大功率kW(String c_发动机_最大功率kW) {
        C_发动机_最大功率kW = c_发动机_最大功率kW;
    }

    public String getC_发动机_最大功率转速rpm() {
        return C_发动机_最大功率转速rpm;
    }

    public void setC_发动机_最大功率转速rpm(String c_发动机_最大功率转速rpm) {
        C_发动机_最大功率转速rpm = c_发动机_最大功率转速rpm;
    }

    public String getC_发动机_最大净功率kW() {
        return C_发动机_最大净功率kW;
    }

    public void setC_发动机_最大净功率kW(String c_发动机_最大净功率kW) {
        C_发动机_最大净功率kW = c_发动机_最大净功率kW;
    }

    public String getC_发动机_最大马力Ps() {
        return C_发动机_最大马力Ps;
    }

    public void setC_发动机_最大马力Ps(String c_发动机_最大马力Ps) {
        C_发动机_最大马力Ps = c_发动机_最大马力Ps;
    }

    public String getC_发动机_最大扭矩Nm() {
        return C_发动机_最大扭矩Nm;
    }

    public void setC_发动机_最大扭矩Nm(String c_发动机_最大扭矩Nm) {
        C_发动机_最大扭矩Nm = c_发动机_最大扭矩Nm;
    }

    public String getC_发动机_最大扭矩转速rpm() {
        return C_发动机_最大扭矩转速rpm;
    }

    public void setC_发动机_最大扭矩转速rpm(String c_发动机_最大扭矩转速rpm) {
        C_发动机_最大扭矩转速rpm = c_发动机_最大扭矩转速rpm;
    }

    public String getC_辅助操控配置_倒车车侧预警系统() {
        return C_辅助操控配置_倒车车侧预警系统;
    }

    public void setC_辅助操控配置_倒车车侧预警系统(String c_辅助操控配置_倒车车侧预警系统) {
        C_辅助操控配置_倒车车侧预警系统 = c_辅助操控配置_倒车车侧预警系统;
    }

    public String getC_辅助操控配置_低速四驱() {
        return C_辅助操控配置_低速四驱;
    }

    public void setC_辅助操控配置_低速四驱(String c_辅助操控配置_低速四驱) {
        C_辅助操控配置_低速四驱 = c_辅助操控配置_低速四驱;
    }

    public String getC_辅助操控配置_底盘透视() {
        return C_辅助操控配置_底盘透视;
    }

    public void setC_辅助操控配置_底盘透视(String c_辅助操控配置_底盘透视) {
        C_辅助操控配置_底盘透视 = c_辅助操控配置_底盘透视;
    }

    public String getC_辅助操控配置_陡坡缓降() {
        return C_辅助操控配置_陡坡缓降;
    }

    public void setC_辅助操控配置_陡坡缓降(String c_辅助操控配置_陡坡缓降) {
        C_辅助操控配置_陡坡缓降 = c_辅助操控配置_陡坡缓降;
    }

    public String getC_辅助操控配置_发动机启停() {
        return C_辅助操控配置_发动机启停;
    }

    public void setC_辅助操控配置_发动机启停(String c_辅助操控配置_发动机启停) {
        C_辅助操控配置_发动机启停 = c_辅助操控配置_发动机启停;
    }

    public String getC_辅助操控配置_防侧翻系统() {
        return C_辅助操控配置_防侧翻系统;
    }

    public void setC_辅助操控配置_防侧翻系统(String c_辅助操控配置_防侧翻系统) {
        C_辅助操控配置_防侧翻系统 = c_辅助操控配置_防侧翻系统;
    }

    public String getC_辅助操控配置_后驻车雷达() {
        return C_辅助操控配置_后驻车雷达;
    }

    public void setC_辅助操控配置_后驻车雷达(String c_辅助操控配置_后驻车雷达) {
        C_辅助操控配置_后驻车雷达 = c_辅助操控配置_后驻车雷达;
    }

    public String getC_辅助操控配置_驾驶辅助影像() {
        return C_辅助操控配置_驾驶辅助影像;
    }

    public void setC_辅助操控配置_驾驶辅助影像(String c_辅助操控配置_驾驶辅助影像) {
        C_辅助操控配置_驾驶辅助影像 = c_辅助操控配置_驾驶辅助影像;
    }

    public String getC_辅助操控配置_驾驶模式选择() {
        return C_辅助操控配置_驾驶模式选择;
    }

    public void setC_辅助操控配置_驾驶模式选择(String c_辅助操控配置_驾驶模式选择) {
        C_辅助操控配置_驾驶模式选择 = c_辅助操控配置_驾驶模式选择;
    }

    public String getC_辅助操控配置_开门碰撞预警() {
        return C_辅助操控配置_开门碰撞预警;
    }

    public void setC_辅助操控配置_开门碰撞预警(String c_辅助操控配置_开门碰撞预警) {
        C_辅助操控配置_开门碰撞预警 = c_辅助操控配置_开门碰撞预警;
    }

    public String getC_辅助操控配置_可变转向比() {
        return C_辅助操控配置_可变转向比;
    }

    public void setC_辅助操控配置_可变转向比(String c_辅助操控配置_可变转向比) {
        C_辅助操控配置_可变转向比 = c_辅助操控配置_可变转向比;
    }

    public String getC_辅助操控配置_疲劳提醒() {
        return C_辅助操控配置_疲劳提醒;
    }

    public void setC_辅助操控配置_疲劳提醒(String c_辅助操控配置_疲劳提醒) {
        C_辅助操控配置_疲劳提醒 = c_辅助操控配置_疲劳提醒;
    }

    public String getC_辅助操控配置_前驻车雷达() {
        return C_辅助操控配置_前驻车雷达;
    }

    public void setC_辅助操控配置_前驻车雷达(String c_辅助操控配置_前驻车雷达) {
        C_辅助操控配置_前驻车雷达 = c_辅助操控配置_前驻车雷达;
    }

    public String getC_辅助操控配置_蠕行模式() {
        return C_辅助操控配置_蠕行模式;
    }

    public void setC_辅助操控配置_蠕行模式(String c_辅助操控配置_蠕行模式) {
        C_辅助操控配置_蠕行模式 = c_辅助操控配置_蠕行模式;
    }

    public String getC_辅助操控配置_上坡辅助() {
        return C_辅助操控配置_上坡辅助;
    }

    public void setC_辅助操控配置_上坡辅助(String c_辅助操控配置_上坡辅助) {
        C_辅助操控配置_上坡辅助 = c_辅助操控配置_上坡辅助;
    }

    public String getC_辅助操控配置_涉水感应系统() {
        return C_辅助操控配置_涉水感应系统;
    }

    public void setC_辅助操控配置_涉水感应系统(String c_辅助操控配置_涉水感应系统) {
        C_辅助操控配置_涉水感应系统 = c_辅助操控配置_涉水感应系统;
    }

    public String getC_辅助操控配置_坦克转弯() {
        return C_辅助操控配置_坦克转弯;
    }

    public void setC_辅助操控配置_坦克转弯(String c_辅助操控配置_坦克转弯) {
        C_辅助操控配置_坦克转弯 = c_辅助操控配置_坦克转弯;
    }

    public String getC_辅助操控配置_巡航系统() {
        return C_辅助操控配置_巡航系统;
    }

    public void setC_辅助操控配置_巡航系统(String c_辅助操控配置_巡航系统) {
        C_辅助操控配置_巡航系统 = c_辅助操控配置_巡航系统;
    }

    public String getC_辅助操控配置_遥控泊车() {
        return C_辅助操控配置_遥控泊车;
    }

    public void setC_辅助操控配置_遥控泊车(String c_辅助操控配置_遥控泊车) {
        C_辅助操控配置_遥控泊车 = c_辅助操控配置_遥控泊车;
    }

    public String getC_辅助操控配置_夜视系统() {
        return C_辅助操控配置_夜视系统;
    }

    public void setC_辅助操控配置_夜视系统(String c_辅助操控配置_夜视系统) {
        C_辅助操控配置_夜视系统 = c_辅助操控配置_夜视系统;
    }

    public String getC_辅助操控配置_远程召唤() {
        return C_辅助操控配置_远程召唤;
    }

    public void setC_辅助操控配置_远程召唤(String c_辅助操控配置_远程召唤) {
        C_辅助操控配置_远程召唤 = c_辅助操控配置_远程召唤;
    }

    public String getC_辅助操控配置_整体主动转向系统() {
        return C_辅助操控配置_整体主动转向系统;
    }

    public void setC_辅助操控配置_整体主动转向系统(String c_辅助操控配置_整体主动转向系统) {
        C_辅助操控配置_整体主动转向系统 = c_辅助操控配置_整体主动转向系统;
    }

    public String getC_辅助操控配置_自动泊车() {
        return C_辅助操控配置_自动泊车;
    }

    public void setC_辅助操控配置_自动泊车(String c_辅助操控配置_自动泊车) {
        C_辅助操控配置_自动泊车 = c_辅助操控配置_自动泊车;
    }

    public String getC_辅助操控配置_自动驻车() {
        return C_辅助操控配置_自动驻车;
    }

    public void setC_辅助操控配置_自动驻车(String c_辅助操控配置_自动驻车) {
        C_辅助操控配置_自动驻车 = c_辅助操控配置_自动驻车;
    }

    public String getC_辅助驾驶功能_并线辅助BSMBSD() {
        return C_辅助驾驶功能_并线辅助BSMBSD;
    }

    public void setC_辅助驾驶功能_并线辅助BSMBSD(String c_辅助驾驶功能_并线辅助BSMBSD) {
        C_辅助驾驶功能_并线辅助BSMBSD = c_辅助驾驶功能_并线辅助BSMBSD;
    }

    public String getC_辅助驾驶功能_车道保持LKAS() {
        return C_辅助驾驶功能_车道保持LKAS;
    }

    public void setC_辅助驾驶功能_车道保持LKAS(String c_辅助驾驶功能_车道保持LKAS) {
        C_辅助驾驶功能_车道保持LKAS = c_辅助驾驶功能_车道保持LKAS;
    }

    public String getC_辅助驾驶功能_车道居中保持() {
        return C_辅助驾驶功能_车道居中保持;
    }

    public void setC_辅助驾驶功能_车道居中保持(String c_辅助驾驶功能_车道居中保持) {
        C_辅助驾驶功能_车道居中保持 = c_辅助驾驶功能_车道居中保持;
    }

    public String getC_辅助驾驶功能_车道偏离预警LDWS() {
        return C_辅助驾驶功能_车道偏离预警LDWS;
    }

    public void setC_辅助驾驶功能_车道偏离预警LDWS(String c_辅助驾驶功能_车道偏离预警LDWS) {
        C_辅助驾驶功能_车道偏离预警LDWS = c_辅助驾驶功能_车道偏离预警LDWS;
    }

    public String getC_辅助驾驶功能_城市辅助驾驶() {
        return C_辅助驾驶功能_城市辅助驾驶;
    }

    public void setC_辅助驾驶功能_城市辅助驾驶(String c_辅助驾驶功能_城市辅助驾驶) {
        C_辅助驾驶功能_城市辅助驾驶 = c_辅助驾驶功能_城市辅助驾驶;
    }

    public String getC_辅助驾驶功能_倒车循迹() {
        return C_辅助驾驶功能_倒车循迹;
    }

    public void setC_辅助驾驶功能_倒车循迹(String c_辅助驾驶功能_倒车循迹) {
        C_辅助驾驶功能_倒车循迹 = c_辅助驾驶功能_倒车循迹;
    }

    public String getC_辅助驾驶功能_道路交通标识识别() {
        return C_辅助驾驶功能_道路交通标识识别;
    }

    public void setC_辅助驾驶功能_道路交通标识识别(String c_辅助驾驶功能_道路交通标识识别) {
        C_辅助驾驶功能_道路交通标识识别 = c_辅助驾驶功能_道路交通标识识别;
    }

    public String getC_辅助驾驶功能_高速辅助驾驶() {
        return C_辅助驾驶功能_高速辅助驾驶;
    }

    public void setC_辅助驾驶功能_高速辅助驾驶(String c_辅助驾驶功能_高速辅助驾驶) {
        C_辅助驾驶功能_高速辅助驾驶 = c_辅助驾驶功能_高速辅助驾驶;
    }

    public String getC_辅助驾驶功能_后方碰撞预警() {
        return C_辅助驾驶功能_后方碰撞预警;
    }

    public void setC_辅助驾驶功能_后方碰撞预警(String c_辅助驾驶功能_后方碰撞预警) {
        C_辅助驾驶功能_后方碰撞预警 = c_辅助驾驶功能_后方碰撞预警;
    }

    public String getC_辅助驾驶功能_前方碰撞预警() {
        return C_辅助驾驶功能_前方碰撞预警;
    }

    public void setC_辅助驾驶功能_前方碰撞预警(String c_辅助驾驶功能_前方碰撞预警) {
        C_辅助驾驶功能_前方碰撞预警 = c_辅助驾驶功能_前方碰撞预警;
    }

    public String getC_辅助驾驶功能_匝道自动驶出入() {
        return C_辅助驾驶功能_匝道自动驶出入;
    }

    public void setC_辅助驾驶功能_匝道自动驶出入(String c_辅助驾驶功能_匝道自动驶出入) {
        C_辅助驾驶功能_匝道自动驶出入 = c_辅助驾驶功能_匝道自动驶出入;
    }

    public String getC_辅助驾驶功能_主动刹车() {
        return C_辅助驾驶功能_主动刹车;
    }

    public void setC_辅助驾驶功能_主动刹车(String c_辅助驾驶功能_主动刹车) {
        C_辅助驾驶功能_主动刹车 = c_辅助驾驶功能_主动刹车;
    }

    public String getC_辅助驾驶功能_自动变道辅助() {
        return C_辅助驾驶功能_自动变道辅助;
    }

    public void setC_辅助驾驶功能_自动变道辅助(String c_辅助驾驶功能_自动变道辅助) {
        C_辅助驾驶功能_自动变道辅助 = c_辅助驾驶功能_自动变道辅助;
    }

    public String getC_辅助驾驶硬件_超声波雷达() {
        return C_辅助驾驶硬件_超声波雷达;
    }

    public void setC_辅助驾驶硬件_超声波雷达(String c_辅助驾驶硬件_超声波雷达) {
        C_辅助驾驶硬件_超声波雷达 = c_辅助驾驶硬件_超声波雷达;
    }

    public String getC_辅助驾驶硬件_车内摄像头() {
        return C_辅助驾驶硬件_车内摄像头;
    }

    public void setC_辅助驾驶硬件_车内摄像头(String c_辅助驾驶硬件_车内摄像头) {
        C_辅助驾驶硬件_车内摄像头 = c_辅助驾驶硬件_车内摄像头;
    }

    public String getC_辅助驾驶硬件_辅助驾驶系统() {
        return C_辅助驾驶硬件_辅助驾驶系统;
    }

    public void setC_辅助驾驶硬件_辅助驾驶系统(String c_辅助驾驶硬件_辅助驾驶系统) {
        C_辅助驾驶硬件_辅助驾驶系统 = c_辅助驾驶硬件_辅助驾驶系统;
    }

    public String getC_辅助驾驶硬件_辅助驾驶芯片() {
        return C_辅助驾驶硬件_辅助驾驶芯片;
    }

    public void setC_辅助驾驶硬件_辅助驾驶芯片(String c_辅助驾驶硬件_辅助驾驶芯片) {
        C_辅助驾驶硬件_辅助驾驶芯片 = c_辅助驾驶硬件_辅助驾驶芯片;
    }

    public String getC_辅助驾驶硬件_毫米波雷达() {
        return C_辅助驾驶硬件_毫米波雷达;
    }

    public void setC_辅助驾驶硬件_毫米波雷达(String c_辅助驾驶硬件_毫米波雷达) {
        C_辅助驾驶硬件_毫米波雷达 = c_辅助驾驶硬件_毫米波雷达;
    }

    public String getC_辅助驾驶硬件_环境感知摄像头() {
        return C_辅助驾驶硬件_环境感知摄像头;
    }

    public void setC_辅助驾驶硬件_环境感知摄像头(String c_辅助驾驶硬件_环境感知摄像头) {
        C_辅助驾驶硬件_环境感知摄像头 = c_辅助驾驶硬件_环境感知摄像头;
    }

    public String getC_辅助驾驶硬件_环境感知摄像头像素万() {
        return C_辅助驾驶硬件_环境感知摄像头像素万;
    }

    public void setC_辅助驾驶硬件_环境感知摄像头像素万(String c_辅助驾驶硬件_环境感知摄像头像素万) {
        C_辅助驾驶硬件_环境感知摄像头像素万 = c_辅助驾驶硬件_环境感知摄像头像素万;
    }

    public String getC_辅助驾驶硬件_环视摄像头() {
        return C_辅助驾驶硬件_环视摄像头;
    }

    public void setC_辅助驾驶硬件_环视摄像头(String c_辅助驾驶硬件_环视摄像头) {
        C_辅助驾驶硬件_环视摄像头 = c_辅助驾驶硬件_环视摄像头;
    }

    public String getC_辅助驾驶硬件_环视摄像头像素万() {
        return C_辅助驾驶硬件_环视摄像头像素万;
    }

    public void setC_辅助驾驶硬件_环视摄像头像素万(String c_辅助驾驶硬件_环视摄像头像素万) {
        C_辅助驾驶硬件_环视摄像头像素万 = c_辅助驾驶硬件_环视摄像头像素万;
    }

    public String getC_辅助驾驶硬件_激光雷达10反射率探测距离m() {
        return C_辅助驾驶硬件_激光雷达10反射率探测距离m;
    }

    public void setC_辅助驾驶硬件_激光雷达10反射率探测距离m(String c_辅助驾驶硬件_激光雷达10反射率探测距离m) {
        C_辅助驾驶硬件_激光雷达10反射率探测距离m = c_辅助驾驶硬件_激光雷达10反射率探测距离m;
    }

    public String getC_辅助驾驶硬件_激光雷达点云数量万秒() {
        return C_辅助驾驶硬件_激光雷达点云数量万秒;
    }

    public void setC_辅助驾驶硬件_激光雷达点云数量万秒(String c_辅助驾驶硬件_激光雷达点云数量万秒) {
        C_辅助驾驶硬件_激光雷达点云数量万秒 = c_辅助驾驶硬件_激光雷达点云数量万秒;
    }

    public String getC_辅助驾驶硬件_激光雷达品牌() {
        return C_辅助驾驶硬件_激光雷达品牌;
    }

    public void setC_辅助驾驶硬件_激光雷达品牌(String c_辅助驾驶硬件_激光雷达品牌) {
        C_辅助驾驶硬件_激光雷达品牌 = c_辅助驾驶硬件_激光雷达品牌;
    }

    public String getC_辅助驾驶硬件_激光雷达数量() {
        return C_辅助驾驶硬件_激光雷达数量;
    }

    public void setC_辅助驾驶硬件_激光雷达数量(String c_辅助驾驶硬件_激光雷达数量) {
        C_辅助驾驶硬件_激光雷达数量 = c_辅助驾驶硬件_激光雷达数量;
    }

    public String getC_辅助驾驶硬件_激光雷达线数() {
        return C_辅助驾驶硬件_激光雷达线数;
    }

    public void setC_辅助驾驶硬件_激光雷达线数(String c_辅助驾驶硬件_激光雷达线数) {
        C_辅助驾驶硬件_激光雷达线数 = c_辅助驾驶硬件_激光雷达线数;
    }

    public String getC_辅助驾驶硬件_激光雷达型号() {
        return C_辅助驾驶硬件_激光雷达型号;
    }

    public void setC_辅助驾驶硬件_激光雷达型号(String c_辅助驾驶硬件_激光雷达型号) {
        C_辅助驾驶硬件_激光雷达型号 = c_辅助驾驶硬件_激光雷达型号;
    }

    public String getC_辅助驾驶硬件_激光雷达最远探测距离m() {
        return C_辅助驾驶硬件_激光雷达最远探测距离m;
    }

    public void setC_辅助驾驶硬件_激光雷达最远探测距离m(String c_辅助驾驶硬件_激光雷达最远探测距离m) {
        C_辅助驾驶硬件_激光雷达最远探测距离m = c_辅助驾驶硬件_激光雷达最远探测距离m;
    }

    public String getC_辅助驾驶硬件_驾驶辅助级别() {
        return C_辅助驾驶硬件_驾驶辅助级别;
    }

    public void setC_辅助驾驶硬件_驾驶辅助级别(String c_辅助驾驶硬件_驾驶辅助级别) {
        C_辅助驾驶硬件_驾驶辅助级别 = c_辅助驾驶硬件_驾驶辅助级别;
    }

    public String getC_辅助驾驶硬件_前方感知摄像头类型() {
        return C_辅助驾驶硬件_前方感知摄像头类型;
    }

    public void setC_辅助驾驶硬件_前方感知摄像头类型(String c_辅助驾驶硬件_前方感知摄像头类型) {
        C_辅助驾驶硬件_前方感知摄像头类型 = c_辅助驾驶硬件_前方感知摄像头类型;
    }

    public String getC_辅助驾驶硬件_前方感知摄像头像素万() {
        return C_辅助驾驶硬件_前方感知摄像头像素万;
    }

    public void setC_辅助驾驶硬件_前方感知摄像头像素万(String c_辅助驾驶硬件_前方感知摄像头像素万) {
        C_辅助驾驶硬件_前方感知摄像头像素万 = c_辅助驾驶硬件_前方感知摄像头像素万;
    }

    public String getC_辅助驾驶硬件_芯片算力() {
        return C_辅助驾驶硬件_芯片算力;
    }

    public void setC_辅助驾驶硬件_芯片算力(String c_辅助驾驶硬件_芯片算力) {
        C_辅助驾驶硬件_芯片算力 = c_辅助驾驶硬件_芯片算力;
    }

    public String getC_基本信息_CLTC纯电续航km() {
        return C_基本信息_CLTC纯电续航km;
    }

    public void setC_基本信息_CLTC纯电续航km(String c_基本信息_CLTC纯电续航km) {
        C_基本信息_CLTC纯电续航km = c_基本信息_CLTC纯电续航km;
    }

    public String getC_基本信息_CLTC综合油耗L100km() {
        return C_基本信息_CLTC综合油耗L100km;
    }

    public void setC_基本信息_CLTC综合油耗L100km(String c_基本信息_CLTC综合油耗L100km) {
        C_基本信息_CLTC综合油耗L100km = c_基本信息_CLTC综合油耗L100km;
    }

    public String getC_基本信息_EPA纯电续航km() {
        return C_基本信息_EPA纯电续航km;
    }

    public void setC_基本信息_EPA纯电续航km(String c_基本信息_EPA纯电续航km) {
        C_基本信息_EPA纯电续航km = c_基本信息_EPA纯电续航km;
    }

    public String getC_基本信息_NEDC纯电续航km() {
        return C_基本信息_NEDC纯电续航km;
    }

    public void setC_基本信息_NEDC纯电续航km(String c_基本信息_NEDC纯电续航km) {
        C_基本信息_NEDC纯电续航km = c_基本信息_NEDC纯电续航km;
    }

    public String getC_基本信息_NEDC综合油耗L100km() {
        return C_基本信息_NEDC综合油耗L100km;
    }

    public void setC_基本信息_NEDC综合油耗L100km(String c_基本信息_NEDC综合油耗L100km) {
        C_基本信息_NEDC综合油耗L100km = c_基本信息_NEDC综合油耗L100km;
    }

    public String getC_基本信息_WLTC纯电续航km() {
        return C_基本信息_WLTC纯电续航km;
    }

    public void setC_基本信息_WLTC纯电续航km(String c_基本信息_WLTC纯电续航km) {
        C_基本信息_WLTC纯电续航km = c_基本信息_WLTC纯电续航km;
    }

    public String getC_基本信息_WLTC综合油耗L100km() {
        return C_基本信息_WLTC综合油耗L100km;
    }

    public void setC_基本信息_WLTC综合油耗L100km(String c_基本信息_WLTC综合油耗L100km) {
        C_基本信息_WLTC综合油耗L100km = c_基本信息_WLTC综合油耗L100km;
    }

    public String getC_基本信息_变速箱() {
        return C_基本信息_变速箱;
    }

    public void setC_基本信息_变速箱(String c_基本信息_变速箱) {
        C_基本信息_变速箱 = c_基本信息_变速箱;
    }

    public String getC_基本信息_厂商() {
        return C_基本信息_厂商;
    }

    public void setC_基本信息_厂商(String c_基本信息_厂商) {
        C_基本信息_厂商 = c_基本信息_厂商;
    }

    public String getC_基本信息_厂商指导价() {
        return C_基本信息_厂商指导价;
    }

    public void setC_基本信息_厂商指导价(String c_基本信息_厂商指导价) {
        C_基本信息_厂商指导价 = c_基本信息_厂商指导价;
    }

    public String getC_基本信息_车款名称() {
        return C_基本信息_车款名称;
    }

    public void setC_基本信息_车款名称(String c_基本信息_车款名称) {
        C_基本信息_车款名称 = c_基本信息_车款名称;
    }

    public String getC_基本信息_车身结构() {
        return C_基本信息_车身结构;
    }

    public void setC_基本信息_车身结构(String c_基本信息_车身结构) {
        C_基本信息_车身结构 = c_基本信息_车身结构;
    }

    public String getC_基本信息_城市参考价() {
        return C_基本信息_城市参考价;
    }

    public void setC_基本信息_城市参考价(String c_基本信息_城市参考价) {
        C_基本信息_城市参考价 = c_基本信息_城市参考价;
    }

    public String getC_基本信息_电动机Ps() {
        return C_基本信息_电动机Ps;
    }

    public void setC_基本信息_电动机Ps(String c_基本信息_电动机Ps) {
        C_基本信息_电动机Ps = c_基本信息_电动机Ps;
    }

    public String getC_基本信息_发动机() {
        return C_基本信息_发动机;
    }

    public void setC_基本信息_发动机(String c_基本信息_发动机) {
        C_基本信息_发动机 = c_基本信息_发动机;
    }

    public String getC_基本信息_官方0100kmh加速s() {
        return C_基本信息_官方0100kmh加速s;
    }

    public void setC_基本信息_官方0100kmh加速s(String c_基本信息_官方0100kmh加速s) {
        C_基本信息_官方0100kmh加速s = c_基本信息_官方0100kmh加速s;
    }

    public String getC_基本信息_环保标准() {
        return C_基本信息_环保标准;
    }

    public void setC_基本信息_环保标准(String c_基本信息_环保标准) {
        C_基本信息_环保标准 = c_基本信息_环保标准;
    }

    public String getC_基本信息_级别() {
        return C_基本信息_级别;
    }

    public void setC_基本信息_级别(String c_基本信息_级别) {
        C_基本信息_级别 = c_基本信息_级别;
    }

    public String getC_基本信息_快充电量() {
        return C_基本信息_快充电量;
    }

    public void setC_基本信息_快充电量(String c_基本信息_快充电量) {
        C_基本信息_快充电量 = c_基本信息_快充电量;
    }

    public String getC_基本信息_快充时间h() {
        return C_基本信息_快充时间h;
    }

    public void setC_基本信息_快充时间h(String c_基本信息_快充时间h) {
        C_基本信息_快充时间h = c_基本信息_快充时间h;
    }

    public String getC_基本信息_亏电状态油耗L100km() {
        return C_基本信息_亏电状态油耗L100km;
    }

    public void setC_基本信息_亏电状态油耗L100km(String c_基本信息_亏电状态油耗L100km) {
        C_基本信息_亏电状态油耗L100km = c_基本信息_亏电状态油耗L100km;
    }

    public String getC_基本信息_慢充电量() {
        return C_基本信息_慢充电量;
    }

    public void setC_基本信息_慢充电量(String c_基本信息_慢充电量) {
        C_基本信息_慢充电量 = c_基本信息_慢充电量;
    }

    public String getC_基本信息_慢充时间h() {
        return C_基本信息_慢充时间h;
    }

    public void setC_基本信息_慢充时间h(String c_基本信息_慢充时间h) {
        C_基本信息_慢充时间h = c_基本信息_慢充时间h;
    }

    public String getC_基本信息_内饰颜色() {
        return C_基本信息_内饰颜色;
    }

    public void setC_基本信息_内饰颜色(String c_基本信息_内饰颜色) {
        C_基本信息_内饰颜色 = c_基本信息_内饰颜色;
    }

    public String getC_基本信息_能源类型() {
        return C_基本信息_能源类型;
    }

    public void setC_基本信息_能源类型(String c_基本信息_能源类型) {
        C_基本信息_能源类型 = c_基本信息_能源类型;
    }

    public String getC_基本信息_上市时间() {
        return C_基本信息_上市时间;
    }

    public void setC_基本信息_上市时间(String c_基本信息_上市时间) {
        C_基本信息_上市时间 = c_基本信息_上市时间;
    }

    public String getC_基本信息_首任车主质保政策() {
        return C_基本信息_首任车主质保政策;
    }

    public void setC_基本信息_首任车主质保政策(String c_基本信息_首任车主质保政策) {
        C_基本信息_首任车主质保政策 = c_基本信息_首任车主质保政策;
    }

    public String getC_基本信息_外观颜色() {
        return C_基本信息_外观颜色;
    }

    public void setC_基本信息_外观颜色(String c_基本信息_外观颜色) {
        C_基本信息_外观颜色 = c_基本信息_外观颜色;
    }

    public String getC_基本信息_长宽高mm() {
        return C_基本信息_长宽高mm;
    }

    public void setC_基本信息_长宽高mm(String c_基本信息_长宽高mm) {
        C_基本信息_长宽高mm = c_基本信息_长宽高mm;
    }

    public String getC_基本信息_整车质保() {
        return C_基本信息_整车质保;
    }

    public void setC_基本信息_整车质保(String c_基本信息_整车质保) {
        C_基本信息_整车质保 = c_基本信息_整车质保;
    }

    public String getC_基本信息_最大功率最大扭矩() {
        return C_基本信息_最大功率最大扭矩;
    }

    public void setC_基本信息_最大功率最大扭矩(String c_基本信息_最大功率最大扭矩) {
        C_基本信息_最大功率最大扭矩 = c_基本信息_最大功率最大扭矩;
    }

    public String getC_基本信息_最高车速kmh() {
        return C_基本信息_最高车速kmh;
    }

    public void setC_基本信息_最高车速kmh(String c_基本信息_最高车速kmh) {
        C_基本信息_最高车速kmh = c_基本信息_最高车速kmh;
    }

    public String getC_空调制冷_车内PM25过滤装置() {
        return C_空调制冷_车内PM25过滤装置;
    }

    public void setC_空调制冷_车内PM25过滤装置(String c_空调制冷_车内PM25过滤装置) {
        C_空调制冷_车内PM25过滤装置 = c_空调制冷_车内PM25过滤装置;
    }

    public String getC_空调制冷_车载冰箱() {
        return C_空调制冷_车载冰箱;
    }

    public void setC_空调制冷_车载冰箱(String c_空调制冷_车载冰箱) {
        C_空调制冷_车载冰箱 = c_空调制冷_车载冰箱;
    }

    public String getC_空调制冷_车载空气净化器() {
        return C_空调制冷_车载空气净化器;
    }

    public void setC_空调制冷_车载空气净化器(String c_空调制冷_车载空气净化器) {
        C_空调制冷_车载空气净化器 = c_空调制冷_车载空气净化器;
    }

    public String getC_空调制冷_第二排空调() {
        return C_空调制冷_第二排空调;
    }

    public void setC_空调制冷_第二排空调(String c_空调制冷_第二排空调) {
        C_空调制冷_第二排空调 = c_空调制冷_第二排空调;
    }

    public String getC_空调制冷_第三排空调() {
        return C_空调制冷_第三排空调;
    }

    public void setC_空调制冷_第三排空调(String c_空调制冷_第三排空调) {
        C_空调制冷_第三排空调 = c_空调制冷_第三排空调;
    }

    public String getC_空调制冷_第一排空调() {
        return C_空调制冷_第一排空调;
    }

    public void setC_空调制冷_第一排空调(String c_空调制冷_第一排空调) {
        C_空调制冷_第一排空调 = c_空调制冷_第一排空调;
    }

    public String getC_空调制冷_负离子发生器() {
        return C_空调制冷_负离子发生器;
    }

    public void setC_空调制冷_负离子发生器(String c_空调制冷_负离子发生器) {
        C_空调制冷_负离子发生器 = c_空调制冷_负离子发生器;
    }

    public String getC_空调制冷_空气质量监测() {
        return C_空调制冷_空气质量监测;
    }

    public void setC_空调制冷_空气质量监测(String c_空调制冷_空气质量监测) {
        C_空调制冷_空气质量监测 = c_空调制冷_空气质量监测;
    }

    public String getC_空调制冷_热泵空调() {
        return C_空调制冷_热泵空调;
    }

    public void setC_空调制冷_热泵空调(String c_空调制冷_热泵空调) {
        C_空调制冷_热泵空调 = c_空调制冷_热泵空调;
    }

    public String getC_空调制冷_香氛系统() {
        return C_空调制冷_香氛系统;
    }

    public void setC_空调制冷_香氛系统(String c_空调制冷_香氛系统) {
        C_空调制冷_香氛系统 = c_空调制冷_香氛系统;
    }

    public String getC_内部配置_ETC装置() {
        return C_内部配置_ETC装置;
    }

    public void setC_内部配置_ETC装置(String c_内部配置_ETC装置) {
        C_内部配置_ETC装置 = c_内部配置_ETC装置;
    }

    public String getC_内部配置_HUD抬头显示() {
        return C_内部配置_HUD抬头显示;
    }

    public void setC_内部配置_HUD抬头显示(String c_内部配置_HUD抬头显示) {
        C_内部配置_HUD抬头显示 = c_内部配置_HUD抬头显示;
    }

    public String getC_内部配置_单踏板模式() {
        return C_内部配置_单踏板模式;
    }

    public void setC_内部配置_单踏板模式(String c_内部配置_单踏板模式) {
        C_内部配置_单踏板模式 = c_内部配置_单踏板模式;
    }

    public String getC_内部配置_电动可调踏板() {
        return C_内部配置_电动可调踏板;
    }

    public void setC_内部配置_电动可调踏板(String c_内部配置_电动可调踏板) {
        C_内部配置_电动可调踏板 = c_内部配置_电动可调踏板;
    }

    public String getC_内部配置_多功能方向盘() {
        return C_内部配置_多功能方向盘;
    }

    public void setC_内部配置_多功能方向盘(String c_内部配置_多功能方向盘) {
        C_内部配置_多功能方向盘 = c_内部配置_多功能方向盘;
    }

    public String getC_内部配置_方向盘材质() {
        return C_内部配置_方向盘材质;
    }

    public void setC_内部配置_方向盘材质(String c_内部配置_方向盘材质) {
        C_内部配置_方向盘材质 = c_内部配置_方向盘材质;
    }

    public String getC_内部配置_方向盘调节() {
        return C_内部配置_方向盘调节;
    }

    public void setC_内部配置_方向盘调节(String c_内部配置_方向盘调节) {
        C_内部配置_方向盘调节 = c_内部配置_方向盘调节;
    }

    public String getC_内部配置_方向盘换挡() {
        return C_内部配置_方向盘换挡;
    }

    public void setC_内部配置_方向盘换挡(String c_内部配置_方向盘换挡) {
        C_内部配置_方向盘换挡 = c_内部配置_方向盘换挡;
    }

    public String getC_内部配置_方向盘加热() {
        return C_内部配置_方向盘加热;
    }

    public void setC_内部配置_方向盘加热(String c_内部配置_方向盘加热) {
        C_内部配置_方向盘加热 = c_内部配置_方向盘加热;
    }

    public String getC_内部配置_换挡形式() {
        return C_内部配置_换挡形式;
    }

    public void setC_内部配置_换挡形式(String c_内部配置_换挡形式) {
        C_内部配置_换挡形式 = c_内部配置_换挡形式;
    }

    public String getC_内部配置_内置行车记录仪() {
        return C_内部配置_内置行车记录仪;
    }

    public void setC_内部配置_内置行车记录仪(String c_内部配置_内置行车记录仪) {
        C_内部配置_内置行车记录仪 = c_内部配置_内置行车记录仪;
    }

    public String getC_内部配置_全液晶仪表盘() {
        return C_内部配置_全液晶仪表盘;
    }

    public void setC_内部配置_全液晶仪表盘(String c_内部配置_全液晶仪表盘) {
        C_内部配置_全液晶仪表盘 = c_内部配置_全液晶仪表盘;
    }

    public String getC_内部配置_手机无线充电() {
        return C_内部配置_手机无线充电;
    }

    public void setC_内部配置_手机无线充电(String c_内部配置_手机无线充电) {
        C_内部配置_手机无线充电 = c_内部配置_手机无线充电;
    }

    public String getC_内部配置_手机无线最大充电功率W() {
        return C_内部配置_手机无线最大充电功率W;
    }

    public void setC_内部配置_手机无线最大充电功率W(String c_内部配置_手机无线最大充电功率W) {
        C_内部配置_手机无线最大充电功率W = c_内部配置_手机无线最大充电功率W;
    }

    public String getC_内部配置_行车电脑显示屏() {
        return C_内部配置_行车电脑显示屏;
    }

    public void setC_内部配置_行车电脑显示屏(String c_内部配置_行车电脑显示屏) {
        C_内部配置_行车电脑显示屏 = c_内部配置_行车电脑显示屏;
    }

    public String getC_内部配置_仪表屏幕材质() {
        return C_内部配置_仪表屏幕材质;
    }

    public void setC_内部配置_仪表屏幕材质(String c_内部配置_仪表屏幕材质) {
        C_内部配置_仪表屏幕材质 = c_内部配置_仪表屏幕材质;
    }

    public String getC_内部配置_仪表屏幕尺寸英寸() {
        return C_内部配置_仪表屏幕尺寸英寸;
    }

    public void setC_内部配置_仪表屏幕尺寸英寸(String c_内部配置_仪表屏幕尺寸英寸) {
        C_内部配置_仪表屏幕尺寸英寸 = c_内部配置_仪表屏幕尺寸英寸;
    }

    public String getC_内部配置_仪表屏幕分辨率px() {
        return C_内部配置_仪表屏幕分辨率px;
    }

    public void setC_内部配置_仪表屏幕分辨率px(String c_内部配置_仪表屏幕分辨率px) {
        C_内部配置_仪表屏幕分辨率px = c_内部配置_仪表屏幕分辨率px;
    }

    public String getC_内部配置_仪表屏幕像素密度PPI() {
        return C_内部配置_仪表屏幕像素密度PPI;
    }

    public void setC_内部配置_仪表屏幕像素密度PPI(String c_内部配置_仪表屏幕像素密度PPI) {
        C_内部配置_仪表屏幕像素密度PPI = c_内部配置_仪表屏幕像素密度PPI;
    }

    public String getC_内部配置_主动降噪() {
        return C_内部配置_主动降噪;
    }

    public void setC_内部配置_主动降噪(String c_内部配置_主动降噪) {
        C_内部配置_主动降噪 = c_内部配置_主动降噪;
    }

    public String getC_外部配置_侧滑门() {
        return C_外部配置_侧滑门;
    }

    public void setC_外部配置_侧滑门(String c_外部配置_侧滑门) {
        C_外部配置_侧滑门 = c_外部配置_侧滑门;
    }

    public String getC_外部配置_车侧脚踏板() {
        return C_外部配置_车侧脚踏板;
    }

    public void setC_外部配置_车侧脚踏板(String c_外部配置_车侧脚踏板) {
        C_外部配置_车侧脚踏板 = c_外部配置_车侧脚踏板;
    }

    public String getC_外部配置_车顶行李架() {
        return C_外部配置_车顶行李架;
    }

    public void setC_外部配置_车顶行李架(String c_外部配置_车顶行李架) {
        C_外部配置_车顶行李架 = c_外部配置_车顶行李架;
    }

    public String getC_外部配置_低速行车警示音() {
        return C_外部配置_低速行车警示音;
    }

    public void setC_外部配置_低速行车警示音(String c_外部配置_低速行车警示音) {
        C_外部配置_低速行车警示音 = c_外部配置_低速行车警示音;
    }

    public String getC_外部配置_电动扰流板() {
        return C_外部配置_电动扰流板;
    }

    public void setC_外部配置_电动扰流板(String c_外部配置_电动扰流板) {
        C_外部配置_电动扰流板 = c_外部配置_电动扰流板;
    }

    public String getC_外部配置_电动尾门() {
        return C_外部配置_电动尾门;
    }

    public void setC_外部配置_电动尾门(String c_外部配置_电动尾门) {
        C_外部配置_电动尾门 = c_外部配置_电动尾门;
    }

    public String getC_外部配置_电吸门() {
        return C_外部配置_电吸门;
    }

    public void setC_外部配置_电吸门(String c_外部配置_电吸门) {
        C_外部配置_电吸门 = c_外部配置_电吸门;
    }

    public String getC_外部配置_感应尾门() {
        return C_外部配置_感应尾门;
    }

    public void setC_外部配置_感应尾门(String c_外部配置_感应尾门) {
        C_外部配置_感应尾门 = c_外部配置_感应尾门;
    }

    public String getC_外部配置_光感天幕() {
        return C_外部配置_光感天幕;
    }

    public void setC_外部配置_光感天幕(String c_外部配置_光感天幕) {
        C_外部配置_光感天幕 = c_外部配置_光感天幕;
    }

    public String getC_外部配置_货箱宝() {
        return C_外部配置_货箱宝;
    }

    public void setC_外部配置_货箱宝(String c_外部配置_货箱宝) {
        C_外部配置_货箱宝 = c_外部配置_货箱宝;
    }

    public String getC_外部配置_轮圈材质() {
        return C_外部配置_轮圈材质;
    }

    public void setC_外部配置_轮圈材质(String c_外部配置_轮圈材质) {
        C_外部配置_轮圈材质 = c_外部配置_轮圈材质;
    }

    public String getC_外部配置_哨兵千里眼模式() {
        return C_外部配置_哨兵千里眼模式;
    }

    public void setC_外部配置_哨兵千里眼模式(String c_外部配置_哨兵千里眼模式) {
        C_外部配置_哨兵千里眼模式 = c_外部配置_哨兵千里眼模式;
    }

    public String getC_外部配置_天窗类型() {
        return C_外部配置_天窗类型;
    }

    public void setC_外部配置_天窗类型(String c_外部配置_天窗类型) {
        C_外部配置_天窗类型 = c_外部配置_天窗类型;
    }

    public String getC_外部配置_拖车钩() {
        return C_外部配置_拖车钩;
    }

    public void setC_外部配置_拖车钩(String c_外部配置_拖车钩) {
        C_外部配置_拖车钩 = c_外部配置_拖车钩;
    }

    public String getC_外部配置_拖车取电口() {
        return C_外部配置_拖车取电口;
    }

    public void setC_外部配置_拖车取电口(String c_外部配置_拖车取电口) {
        C_外部配置_拖车取电口 = c_外部配置_拖车取电口;
    }

    public String getC_外部配置_尾门玻璃独立开启() {
        return C_外部配置_尾门玻璃独立开启;
    }

    public void setC_外部配置_尾门玻璃独立开启(String c_外部配置_尾门玻璃独立开启) {
        C_外部配置_尾门玻璃独立开启 = c_外部配置_尾门玻璃独立开启;
    }

    public String getC_外部配置_尾门位置记忆() {
        return C_外部配置_尾门位置记忆;
    }

    public void setC_外部配置_尾门位置记忆(String c_外部配置_尾门位置记忆) {
        C_外部配置_尾门位置记忆 = c_外部配置_尾门位置记忆;
    }

    public String getC_外部配置_无框车门() {
        return C_外部配置_无框车门;
    }

    public void setC_外部配置_无框车门(String c_外部配置_无框车门) {
        C_外部配置_无框车门 = c_外部配置_无框车门;
    }

    public String getC_外部配置_无钥匙进入() {
        return C_外部配置_无钥匙进入;
    }

    public void setC_外部配置_无钥匙进入(String c_外部配置_无钥匙进入) {
        C_外部配置_无钥匙进入 = c_外部配置_无钥匙进入;
    }

    public String getC_外部配置_无钥匙启动() {
        return C_外部配置_无钥匙启动;
    }

    public void setC_外部配置_无钥匙启动(String c_外部配置_无钥匙启动) {
        C_外部配置_无钥匙启动 = c_外部配置_无钥匙启动;
    }

    public String getC_外部配置_钥匙类型() {
        return C_外部配置_钥匙类型;
    }

    public void setC_外部配置_钥匙类型(String c_外部配置_钥匙类型) {
        C_外部配置_钥匙类型 = c_外部配置_钥匙类型;
    }

    public String getC_外部配置_隐藏电动门把手() {
        return C_外部配置_隐藏电动门把手;
    }

    public void setC_外部配置_隐藏电动门把手(String c_外部配置_隐藏电动门把手) {
        C_外部配置_隐藏电动门把手 = c_外部配置_隐藏电动门把手;
    }

    public String getC_外部配置_运动外观套件() {
        return C_外部配置_运动外观套件;
    }

    public void setC_外部配置_运动外观套件(String c_外部配置_运动外观套件) {
        C_外部配置_运动外观套件 = c_外部配置_运动外观套件;
    }

    public String getC_外部配置_整车无线充电() {
        return C_外部配置_整车无线充电;
    }

    public void setC_外部配置_整车无线充电(String c_外部配置_整车无线充电) {
        C_外部配置_整车无线充电 = c_外部配置_整车无线充电;
    }

    public String getC_外部配置_主动闭合式进气格栅() {
        return C_外部配置_主动闭合式进气格栅;
    }

    public void setC_外部配置_主动闭合式进气格栅(String c_外部配置_主动闭合式进气格栅) {
        C_外部配置_主动闭合式进气格栅 = c_外部配置_主动闭合式进气格栅;
    }

    public String getC_外部配置_自动开合车门() {
        return C_外部配置_自动开合车门;
    }

    public void setC_外部配置_自动开合车门(String c_外部配置_自动开合车门) {
        C_外部配置_自动开合车门 = c_外部配置_自动开合车门;
    }

    public String getC_影音娱乐_USBTypeC接口数量() {
        return C_影音娱乐_USBTypeC接口数量;
    }

    public void setC_影音娱乐_USBTypeC接口数量(String c_影音娱乐_USBTypeC接口数量) {
        C_影音娱乐_USBTypeC接口数量 = c_影音娱乐_USBTypeC接口数量;
    }

    public String getC_影音娱乐_车内娱乐功能() {
        return C_影音娱乐_车内娱乐功能;
    }

    public void setC_影音娱乐_车内娱乐功能(String c_影音娱乐_车内娱乐功能) {
        C_影音娱乐_车内娱乐功能 = c_影音娱乐_车内娱乐功能;
    }

    public String getC_影音娱乐_车载APP应用市场() {
        return C_影音娱乐_车载APP应用市场;
    }

    public void setC_影音娱乐_车载APP应用市场(String c_影音娱乐_车载APP应用市场) {
        C_影音娱乐_车载APP应用市场 = c_影音娱乐_车载APP应用市场;
    }

    public String getC_影音娱乐_车载CDDVD() {
        return C_影音娱乐_车载CDDVD;
    }

    public void setC_影音娱乐_车载CDDVD(String c_影音娱乐_车载CDDVD) {
        C_影音娱乐_车载CDDVD = c_影音娱乐_车载CDDVD;
    }

    public String getC_影音娱乐_多媒体充电接口() {
        return C_影音娱乐_多媒体充电接口;
    }

    public void setC_影音娱乐_多媒体充电接口(String c_影音娱乐_多媒体充电接口) {
        C_影音娱乐_多媒体充电接口 = c_影音娱乐_多媒体充电接口;
    }

    public String getC_影音娱乐_分屏功能() {
        return C_影音娱乐_分屏功能;
    }

    public void setC_影音娱乐_分屏功能(String c_影音娱乐_分屏功能) {
        C_影音娱乐_分屏功能 = c_影音娱乐_分屏功能;
    }

    public String getC_影音娱乐_后排多媒体屏幕材质() {
        return C_影音娱乐_后排多媒体屏幕材质;
    }

    public void setC_影音娱乐_后排多媒体屏幕材质(String c_影音娱乐_后排多媒体屏幕材质) {
        C_影音娱乐_后排多媒体屏幕材质 = c_影音娱乐_后排多媒体屏幕材质;
    }

    public String getC_影音娱乐_后排多媒体屏幕尺寸英寸() {
        return C_影音娱乐_后排多媒体屏幕尺寸英寸;
    }

    public void setC_影音娱乐_后排多媒体屏幕尺寸英寸(String c_影音娱乐_后排多媒体屏幕尺寸英寸) {
        C_影音娱乐_后排多媒体屏幕尺寸英寸 = c_影音娱乐_后排多媒体屏幕尺寸英寸;
    }

    public String getC_影音娱乐_后排多媒体屏幕分辨率px() {
        return C_影音娱乐_后排多媒体屏幕分辨率px;
    }

    public void setC_影音娱乐_后排多媒体屏幕分辨率px(String c_影音娱乐_后排多媒体屏幕分辨率px) {
        C_影音娱乐_后排多媒体屏幕分辨率px = c_影音娱乐_后排多媒体屏幕分辨率px;
    }

    public String getC_影音娱乐_后排多媒体屏幕数量() {
        return C_影音娱乐_后排多媒体屏幕数量;
    }

    public void setC_影音娱乐_后排多媒体屏幕数量(String c_影音娱乐_后排多媒体屏幕数量) {
        C_影音娱乐_后排多媒体屏幕数量 = c_影音娱乐_后排多媒体屏幕数量;
    }

    public String getC_影音娱乐_后排多媒体屏幕刷新率Hz() {
        return C_影音娱乐_后排多媒体屏幕刷新率Hz;
    }

    public void setC_影音娱乐_后排多媒体屏幕刷新率Hz(String c_影音娱乐_后排多媒体屏幕刷新率Hz) {
        C_影音娱乐_后排多媒体屏幕刷新率Hz = c_影音娱乐_后排多媒体屏幕刷新率Hz;
    }

    public String getC_影音娱乐_后排多媒体屏幕像素密度PPI() {
        return C_影音娱乐_后排多媒体屏幕像素密度PPI;
    }

    public void setC_影音娱乐_后排多媒体屏幕像素密度PPI(String c_影音娱乐_后排多媒体屏幕像素密度PPI) {
        C_影音娱乐_后排多媒体屏幕像素密度PPI = c_影音娱乐_后排多媒体屏幕像素密度PPI;
    }

    public String getC_影音娱乐_后排控制多媒体() {
        return C_影音娱乐_后排控制多媒体;
    }

    public void setC_影音娱乐_后排控制多媒体(String c_影音娱乐_后排控制多媒体) {
        C_影音娱乐_后排控制多媒体 = c_影音娱乐_后排控制多媒体;
    }

    public String getC_影音娱乐_模拟声浪() {
        return C_影音娱乐_模拟声浪;
    }

    public void setC_影音娱乐_模拟声浪(String c_影音娱乐_模拟声浪) {
        C_影音娱乐_模拟声浪 = c_影音娱乐_模拟声浪;
    }

    public String getC_影音娱乐_行李厢电源接口() {
        return C_影音娱乐_行李厢电源接口;
    }

    public void setC_影音娱乐_行李厢电源接口(String c_影音娱乐_行李厢电源接口) {
        C_影音娱乐_行李厢电源接口 = c_影音娱乐_行李厢电源接口;
    }

    public String getC_影音娱乐_扬声器数量() {
        return C_影音娱乐_扬声器数量;
    }

    public void setC_影音娱乐_扬声器数量(String c_影音娱乐_扬声器数量) {
        C_影音娱乐_扬声器数量 = c_影音娱乐_扬声器数量;
    }

    public String getC_影音娱乐_音响品牌() {
        return C_影音娱乐_音响品牌;
    }

    public void setC_影音娱乐_音响品牌(String c_影音娱乐_音响品牌) {
        C_影音娱乐_音响品牌 = c_影音娱乐_音响品牌;
    }

    public String getC_影音娱乐_座舱220V230V电源() {
        return C_影音娱乐_座舱220V230V电源;
    }

    public void setC_影音娱乐_座舱220V230V电源(String c_影音娱乐_座舱220V230V电源) {
        C_影音娱乐_座舱220V230V电源 = c_影音娱乐_座舱220V230V电源;
    }

    public String getC_主动安全_ABS防抱死() {
        return C_主动安全_ABS防抱死;
    }

    public void setC_主动安全_ABS防抱死(String c_主动安全_ABS防抱死) {
        C_主动安全_ABS防抱死 = c_主动安全_ABS防抱死;
    }

    public String getC_主动安全_安全带未系提醒() {
        return C_主动安全_安全带未系提醒;
    }

    public void setC_主动安全_安全带未系提醒(String c_主动安全_安全带未系提醒) {
        C_主动安全_安全带未系提醒 = c_主动安全_安全带未系提醒;
    }

    public String getC_主动安全_车内生物监测() {
        return C_主动安全_车内生物监测;
    }

    public void setC_主动安全_车内生物监测(String c_主动安全_车内生物监测) {
        C_主动安全_车内生物监测 = c_主动安全_车内生物监测;
    }

    public String getC_主动安全_车身稳定控制ESPDSCVSC等() {
        return C_主动安全_车身稳定控制ESPDSCVSC等;
    }

    public void setC_主动安全_车身稳定控制ESPDSCVSC等(String c_主动安全_车身稳定控制ESPDSCVSC等) {
        C_主动安全_车身稳定控制ESPDSCVSC等 = c_主动安全_车身稳定控制ESPDSCVSC等;
    }

    public String getC_主动安全_牵引力控制ASRTCSTRC等() {
        return C_主动安全_牵引力控制ASRTCSTRC等;
    }

    public void setC_主动安全_牵引力控制ASRTCSTRC等(String c_主动安全_牵引力控制ASRTCSTRC等) {
        C_主动安全_牵引力控制ASRTCSTRC等 = c_主动安全_牵引力控制ASRTCSTRC等;
    }

    public String getC_主动安全_胎压监测() {
        return C_主动安全_胎压监测;
    }

    public void setC_主动安全_胎压监测(String c_主动安全_胎压监测) {
        C_主动安全_胎压监测 = c_主动安全_胎压监测;
    }

    public String getC_主动安全_制动辅助BAEBABAS等() {
        return C_主动安全_制动辅助BAEBABAS等;
    }

    public void setC_主动安全_制动辅助BAEBABAS等(String c_主动安全_制动辅助BAEBABAS等) {
        C_主动安全_制动辅助BAEBABAS等 = c_主动安全_制动辅助BAEBABAS等;
    }

    public String getC_主动安全_制动力分配EBDCBC等() {
        return C_主动安全_制动力分配EBDCBC等;
    }

    public void setC_主动安全_制动力分配EBDCBC等(String c_主动安全_制动力分配EBDCBC等) {
        C_主动安全_制动力分配EBDCBC等 = c_主动安全_制动力分配EBDCBC等;
    }

    public String getC_座椅配置_第二排座椅电动调节() {
        return C_座椅配置_第二排座椅电动调节;
    }

    public void setC_座椅配置_第二排座椅电动调节(String c_座椅配置_第二排座椅电动调节) {
        C_座椅配置_第二排座椅电动调节 = c_座椅配置_第二排座椅电动调节;
    }

    public String getC_座椅配置_第二排座椅调节方式() {
        return C_座椅配置_第二排座椅调节方式;
    }

    public void setC_座椅配置_第二排座椅调节方式(String c_座椅配置_第二排座椅调节方式) {
        C_座椅配置_第二排座椅调节方式 = c_座椅配置_第二排座椅调节方式;
    }

    public String getC_座椅配置_第二排座椅功能() {
        return C_座椅配置_第二排座椅功能;
    }

    public void setC_座椅配置_第二排座椅功能(String c_座椅配置_第二排座椅功能) {
        C_座椅配置_第二排座椅功能 = c_座椅配置_第二排座椅功能;
    }

    public String getC_座椅配置_第三排座椅电动调节() {
        return C_座椅配置_第三排座椅电动调节;
    }

    public void setC_座椅配置_第三排座椅电动调节(String c_座椅配置_第三排座椅电动调节) {
        C_座椅配置_第三排座椅电动调节 = c_座椅配置_第三排座椅电动调节;
    }

    public String getC_座椅配置_第三排座椅调节方式() {
        return C_座椅配置_第三排座椅调节方式;
    }

    public void setC_座椅配置_第三排座椅调节方式(String c_座椅配置_第三排座椅调节方式) {
        C_座椅配置_第三排座椅调节方式 = c_座椅配置_第三排座椅调节方式;
    }

    public String getC_座椅配置_第三排座椅功能() {
        return C_座椅配置_第三排座椅功能;
    }

    public void setC_座椅配置_第三排座椅功能(String c_座椅配置_第三排座椅功能) {
        C_座椅配置_第三排座椅功能 = c_座椅配置_第三排座椅功能;
    }

    public String getC_座椅配置_第一排座椅功能() {
        return C_座椅配置_第一排座椅功能;
    }

    public void setC_座椅配置_第一排座椅功能(String c_座椅配置_第一排座椅功能) {
        C_座椅配置_第一排座椅功能 = c_座椅配置_第一排座椅功能;
    }

    public String getC_座椅配置_电动脚托() {
        return C_座椅配置_电动脚托;
    }

    public void setC_座椅配置_电动脚托(String c_座椅配置_电动脚托) {
        C_座椅配置_电动脚托 = c_座椅配置_电动脚托;
    }

    public String getC_座椅配置_福祉座椅() {
        return C_座椅配置_福祉座椅;
    }

    public void setC_座椅配置_福祉座椅(String c_座椅配置_福祉座椅) {
        C_座椅配置_福祉座椅 = c_座椅配置_福祉座椅;
    }

    public String getC_座椅配置_副驾座椅电动调节() {
        return C_座椅配置_副驾座椅电动调节;
    }

    public void setC_座椅配置_副驾座椅电动调节(String c_座椅配置_副驾座椅电动调节) {
        C_座椅配置_副驾座椅电动调节 = c_座椅配置_副驾座椅电动调节;
    }

    public String getC_座椅配置_副驾座椅调节方式() {
        return C_座椅配置_副驾座椅调节方式;
    }

    public void setC_座椅配置_副驾座椅调节方式(String c_座椅配置_副驾座椅调节方式) {
        C_座椅配置_副驾座椅调节方式 = c_座椅配置_副驾座椅调节方式;
    }

    public String getC_座椅配置_后排杯架() {
        return C_座椅配置_后排杯架;
    }

    public void setC_座椅配置_后排杯架(String c_座椅配置_后排杯架) {
        C_座椅配置_后排杯架 = c_座椅配置_后排杯架;
    }

    public String getC_座椅配置_后排折叠桌板() {
        return C_座椅配置_后排折叠桌板;
    }

    public void setC_座椅配置_后排折叠桌板(String c_座椅配置_后排折叠桌板) {
        C_座椅配置_后排折叠桌板 = c_座椅配置_后排折叠桌板;
    }

    public String getC_座椅配置_后排座椅电动放倒() {
        return C_座椅配置_后排座椅电动放倒;
    }

    public void setC_座椅配置_后排座椅电动放倒(String c_座椅配置_后排座椅电动放倒) {
        C_座椅配置_后排座椅电动放倒 = c_座椅配置_后排座椅电动放倒;
    }

    public String getC_座椅配置_后排座椅放倒方式() {
        return C_座椅配置_后排座椅放倒方式;
    }

    public void setC_座椅配置_后排座椅放倒方式(String c_座椅配置_后排座椅放倒方式) {
        C_座椅配置_后排座椅放倒方式 = c_座椅配置_后排座椅放倒方式;
    }

    public String getC_座椅配置_加热制冷杯架() {
        return C_座椅配置_加热制冷杯架;
    }

    public void setC_座椅配置_加热制冷杯架(String c_座椅配置_加热制冷杯架) {
        C_座椅配置_加热制冷杯架 = c_座椅配置_加热制冷杯架;
    }

    public String getC_座椅配置_老板键() {
        return C_座椅配置_老板键;
    }

    public void setC_座椅配置_老板键(String c_座椅配置_老板键) {
        C_座椅配置_老板键 = c_座椅配置_老板键;
    }

    public String getC_座椅配置_零重力座椅功能() {
        return C_座椅配置_零重力座椅功能;
    }

    public void setC_座椅配置_零重力座椅功能(String c_座椅配置_零重力座椅功能) {
        C_座椅配置_零重力座椅功能 = c_座椅配置_零重力座椅功能;
    }

    public String getC_座椅配置_运动风格座椅() {
        return C_座椅配置_运动风格座椅;
    }

    public void setC_座椅配置_运动风格座椅(String c_座椅配置_运动风格座椅) {
        C_座椅配置_运动风格座椅 = c_座椅配置_运动风格座椅;
    }

    public String getC_座椅配置_中央扶手() {
        return C_座椅配置_中央扶手;
    }

    public void setC_座椅配置_中央扶手(String c_座椅配置_中央扶手) {
        C_座椅配置_中央扶手 = c_座椅配置_中央扶手;
    }

    public String getC_座椅配置_主驾座椅电动调节() {
        return C_座椅配置_主驾座椅电动调节;
    }

    public void setC_座椅配置_主驾座椅电动调节(String c_座椅配置_主驾座椅电动调节) {
        C_座椅配置_主驾座椅电动调节 = c_座椅配置_主驾座椅电动调节;
    }

    public String getC_座椅配置_主驾座椅调节方式() {
        return C_座椅配置_主驾座椅调节方式;
    }

    public void setC_座椅配置_主驾座椅调节方式(String c_座椅配置_主驾座椅调节方式) {
        C_座椅配置_主驾座椅调节方式 = c_座椅配置_主驾座椅调节方式;
    }

    public String getC_座椅配置_座椅布局() {
        return C_座椅配置_座椅布局;
    }

    public void setC_座椅配置_座椅布局(String c_座椅配置_座椅布局) {
        C_座椅配置_座椅布局 = c_座椅配置_座椅布局;
    }

    public String getC_座椅配置_座椅材质() {
        return C_座椅配置_座椅材质;
    }

    public void setC_座椅配置_座椅材质(String c_座椅配置_座椅材质) {
        C_座椅配置_座椅材质 = c_座椅配置_座椅材质;
    }
}
